{
  "name": "ACCOUNT_CONS_SP_SA_BILL",
  "description": "Applies only if you have enabled the consolidated balances functionality. Contains information about the guarantors and their balances that are sent to a different service area for billing to the guarantor.",
  "primaryKey": [
    {
      "columnName": "ACCT_ID",
      "ordinalPosition": 1
    }
  ],
  "columns": [
    {
      "ordinalPosition": 1,
      "name": "ACCT_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "The unique identifier (.1 item) for the account record."
    },
    {
      "ordinalPosition": 2,
      "name": "PB_CONS_SP_TOT_BAL",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "Applies only if you have enabled the consolidated balances functionality. The total PB balance of the hospital accounts sent to a different service area for billing to the guarantor."
    },
    {
      "ordinalPosition": 3,
      "name": "PB_CONS_SP_PAT_BAL",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "Applies only if you have enabled the consolidated balances functionality. The total PB self-pay balance of the hospital accounts sent to a different service area for billing to the guarantor."
    },
    {
      "ordinalPosition": 4,
      "name": "PB_CONS_SP_INS_BAL",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "Applies only if you have enabled the consolidated balances functionality. The total PB insurance balance of the hospital accounts sent to a different service area for billing to the guarantor."
    },
    {
      "ordinalPosition": 5,
      "name": "PB_CONS_SP_CONTEST_PAT_BAL",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "Applies only if you have enabled the consolidated balances functionality. The total PB contested self-pay balance of the hospital accounts sent to a different service area for billing to the guarantor."
    },
    {
      "ordinalPosition": 6,
      "name": "PB_CONS_SP_EXT_BD_PAT_BAL",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "Applies only if you have enabled the consolidated balances functionality. The total PB external AR bad debt self-pay balance of the hospital accounts sent to a different service area for billing to the guarantor."
    },
    {
      "ordinalPosition": 7,
      "name": "PB_CONS_SP_EXT_BD_INS_BAL",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "Applies only if you have enabled the consolidated balances functionality. The total PB external AR bad debt insurance balance of the hospital accounts sent to a different service area for billing to the guarantor."
    },
    {
      "ordinalPosition": 8,
      "name": "PB_CONS_SP_CONT_EXT_AR_PAT_BAL",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "Applies only if you have enabled the consolidated balances functionality. The total PB contested external AR balance of the hospital accounts sent to a different service area for billing to the guarantor."
    },
    {
      "ordinalPosition": 9,
      "name": "PB_CONS_SP_EXT_AR_PAT_BAL",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "Applies only if you have enabled the consolidated balances functionality. The total PB external AR self-pay balance of the hospital accounts sent to a different service area for billing to the guarantor."
    },
    {
      "ordinalPosition": 10,
      "name": "PB_CONS_SP_EXT_AR_INS_BAL",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "Applies only if you have enabled the consolidated balances functionality. The total PB external AR insurance balance of the hospital accounts sent to a different service area for billing to the guarantor."
    },
    {
      "ordinalPosition": 11,
      "name": "PB_CONS_SP_UNDIST_INS_BAL",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "Applies only if you have enabled the consolidated balances functionality. The total PB undistributed insurance credits sent to a different service area for billing to the guarantor."
    },
    {
      "ordinalPosition": 12,
      "name": "PB_CONS_SP_UNDIST_PAT_BAL",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "Applies only if you have enabled the consolidated balances functionality. The total PB undistributed self-pay credits sent to a different service area for billing to the guarantor."
    },
    {
      "ordinalPosition": 13,
      "name": "CONS_SP_ACCT_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "Applies only if you have enabled the consolidated balances functionality. The target guarantor in the target service area to whom the balances are sent for billing."
    },
    {
      "ordinalPosition": 14,
      "name": "HB_CONS_SP_TOT_BAL",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "Applies only if you have enabled the consolidated balances functionality. The total HB balance of the hospital accounts sent to a different service area for billing to the guarantor."
    },
    {
      "ordinalPosition": 15,
      "name": "HB_CONS_SP_PREBILL_BAL",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "Applies only if you have enabled the consolidated balances functionality. The total HB prebilled balance of the hospital accounts sent to a different service area for billing to the guarantor."
    },
    {
      "ordinalPosition": 16,
      "name": "HB_CONS_SP_INS_BAL",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "Applies only if you have enabled the consolidated balances functionality. The total HB insurance balance of the hospital accounts sent to a different service area for billing to the guarantor."
    },
    {
      "ordinalPosition": 17,
      "name": "HB_CONS_SP_PAT_BAL",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "Applies only if you have enabled the consolidated balances functionality. The total HB self-pay balance of the hospital accounts sent to a different service area for billing to the guarantor."
    },
    {
      "ordinalPosition": 18,
      "name": "HB_CONS_SP_UNDIST_BAL",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "Applies only if you have enabled the consolidated balances functionality. The total HB undistributed balance of the hospital accounts sent to a different service area for billing to the guarantor."
    },
    {
      "ordinalPosition": 19,
      "name": "HB_CONS_SP_BAD_DEBT_PAT_BAL",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "Applies only if you have enabled the consolidated balances functionality. The total HB bad debt self-pay balance of the hospital accounts sent to a different service area for billing to the guarantor."
    },
    {
      "ordinalPosition": 20,
      "name": "HB_CONS_SP_BAD_DEBT_INS_BAL",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "Applies only if you have enabled the consolidated balances functionality. The total HB bad debt insurance balance of the hospital accounts sent to a different service area for billing to the guarantor."
    },
    {
      "ordinalPosition": 21,
      "name": "HB_CONS_SP_BAD_DEBT_UNDIST_BAL",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "Applies only if you have enabled the consolidated balances functionality. The total HB bad debt undistributed balance of the hospital accounts sent to a different service area for billing to the guarantor."
    },
    {
      "ordinalPosition": 22,
      "name": "HB_CONS_SP_EXT_AR_INS_BAL",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "Applies only if you have enabled the consolidated balances functionality. The total HB external AR insurance balance of the hospital accounts sent to a different service area for billing to the guarantor."
    },
    {
      "ordinalPosition": 23,
      "name": "HB_CONS_SP_EXT_AR_PAT_BAL",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "Applies only if you have enabled the consolidated balances functionality. The total HB external AR self-pay balance of the hospital accounts sent to a different service area for billing to the guarantor."
    },
    {
      "ordinalPosition": 24,
      "name": "HB_CONS_SP_EXT_AR_UNDIST_BAL",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "Applies only if you have enabled the consolidated balances functionality. The total HB external AR undistributed balance of the hospital accounts sent to a different service area for billing to the guarantor."
    },
    {
      "ordinalPosition": 25,
      "name": "HB_CONS_SP_IN_PROG_PAT_BAL",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "Applies only if you have enabled the consolidated balances functionality. The HB self-pay balance of in progress accounts for the guarantor that are sent to a different service area, excluding hospital accounts in external AR or bad debt. In progress accounts are those that have not yet been billed to self-pay."
    },
    {
      "ordinalPosition": 26,
      "name": "HB_CONS_SP_IN_PROG_BD_PAT_BAL",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "Applies only if you have enabled the consolidated balances functionality. The HB self-pay balance of in progress bad debt accounts for the guarantor that are sent to a different service area. In progress accounts are those that have not yet been billed to self-pay."
    },
    {
      "ordinalPosition": 27,
      "name": "HB_CONS_SP_INPROG_EXTAR_PATBAL",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "Applies only if you have enabled the consolidated balances functionality. The HB self-pay balance of in progress external AR accounts for the guarantor that are sent to a different service area. In progress accounts are those that have not yet been billed to self-pay."
    },
    {
      "ordinalPosition": 28,
      "name": "HB_CONS_SP_CONTEST_PAT_BAL",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "Applies only if you have enabled the consolidated balances functionality. The HB self-pay balance of contested accounts for the guarantor that are sent to a different service area, excluding hospital accounts in external AR or bad debt."
    },
    {
      "ordinalPosition": 29,
      "name": "HB_CONS_SP_CONTEST_BD_PAT_BAL",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "Applies only if you have enabled the consolidated balances functionality. The HB bad debt self-pay balance of contested accounts for the guarantor that are sent to a different service area."
    },
    {
      "ordinalPosition": 30,
      "name": "HB_CONS_SP_CONTST_EXTAR_PATBAL",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "Applies only if you have enabled the consolidated balances functionality. The HB External AR self-pay balance of contested accounts for the guarantor that are sent to a different service area."
    }
  ]
}
