{
  "name": "AVS_ACK_MED_INFO",
  "description": "This table contains data regarding when a user acknowledges that the medications instructions for the after visit summary are still valid if the medication list changed since the instructions were last edited.",
  "primaryKey": [
    {
      "columnName": "PAT_ENC_CSN_ID",
      "ordinalPosition": 1
    },
    {
      "columnName": "LINE",
      "ordinalPosition": 2
    }
  ],
  "columns": [
    {
      "ordinalPosition": 1,
      "name": "PAT_ENC_CSN_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "The unique contact serial number for this contact. This number is unique across all patient encounters in your system. If you use IntraConnect, this is the Unique Contact Identifier (UCI)."
    },
    {
      "ordinalPosition": 2,
      "name": "LINE",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The line number for the information associated with this contact. Multiple pieces of information can be associated with this contact."
    },
    {
      "ordinalPosition": 3,
      "name": "PAT_ENC_DATE_REAL",
      "type": "FLOAT",
      "discontinued": false,
      "description": "A unique contact date in decimal format. The integer portion of the number indicates the date of contact. The digits after the decimal distinguish different contacts on the same date and are unique for each contact on that date. For example, .00 is the first/only contact, .01 is the second contact, etc."
    },
    {
      "ordinalPosition": 4,
      "name": "CONTACT_DATE",
      "type": "DATETIME",
      "discontinued": false,
      "description": "The date of this contact in calendar format."
    },
    {
      "ordinalPosition": 5,
      "name": "CM_CT_OWNER_ID",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The Community ID (CID) of the instance that owns this contact. This is only populated if you use IntraConnect."
    },
    {
      "ordinalPosition": 6,
      "name": "AVS_ACK_MED_USER_ID",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The unique ID associated with the user who acknowledged that the medication instructions in the after visit summary are still correct after the discharge medication list has changed since the instructions were last edited."
    },
    {
      "ordinalPosition": 7,
      "name": "AVS_ACK_MED_USER_ID_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The name of the user record. This name may be hidden."
    },
    {
      "ordinalPosition": 8,
      "name": "AVS_ACK_MED_DTTM",
      "type": "DATETIME (UTC) ",
      "discontinued": false,
      "description": "This item contains the UTC instant at which a user acknowledged that the medication instructions in the after visit summary are still correct after the discharge medication list has changed since the instructions were last edited."
    }
  ]
}
