{
  "name": "BEN_ACCUMULATION_HX_ACCT",
  "description": "This table contains a history of claims, charges, and manual adjustments made to account-level benefit buckets on coverages.",
  "primaryKey": [
    {
      "columnName": "COVERAGE_ID",
      "ordinalPosition": 1
    },
    {
      "columnName": "LINE",
      "ordinalPosition": 2
    }
  ],
  "columns": [
    {
      "ordinalPosition": 1,
      "name": "COVERAGE_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "The coverage record's ID."
    },
    {
      "ordinalPosition": 2,
      "name": "LINE",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The line count for the coverage record's account bucket history."
    },
    {
      "ordinalPosition": 3,
      "name": "ACCT_BKT_PAT_ID",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The unique ID of the patient for the coverage's account bucket history."
    },
    {
      "ordinalPosition": 4,
      "name": "ACCT_BKT_DATE",
      "type": "DATETIME",
      "discontinued": false,
      "description": "The date of service for the account level bucket update."
    },
    {
      "ordinalPosition": 5,
      "name": "ACCT_BKT_SRC_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The source of the account-level bucket update.",
      "entries": [
        "Conversion",
        "Manual Adjustment",
        "Charge",
        "Claim",
        "Pharmacy Confirmation",
        "Pro-Ration Adjustment",
        "Benefit Bucket Import",
        "HB Charge",
        "System Adjustment",
        "HRA Funding",
        "Adjustment Reversal"
      ]
    },
    {
      "ordinalPosition": 6,
      "name": "ACCT_BKT_CLAIM_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "If the source of this accumulation is a claim, then this field will store the unique identifier of that accounts payable claim record."
    },
    {
      "ordinalPosition": 7,
      "name": "ACCT_BKT_AMT",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "The amount by which the account level bucket was adjusted."
    },
    {
      "ordinalPosition": 8,
      "name": "ACCT_BKT_CVG_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "If this account level update is due to carryover from another coverage, this item will store the unique coverage ID of the source."
    },
    {
      "ordinalPosition": 9,
      "name": "ACCT_BKT_RFL_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "If the source is pharmacy confirmation (ACCT_BKT_SRC_C = 4), then the unique identifier of the relevant referral."
    },
    {
      "ordinalPosition": 10,
      "name": "ACCT_BKT_CMT",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The free text comment about the account level bucket update."
    },
    {
      "ordinalPosition": 11,
      "name": "ACCT_BKT_USER_ID",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The unique ID of the user associated with the account level bucket update."
    },
    {
      "ordinalPosition": 12,
      "name": "ACCT_BKT_USER_ID_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The name of the user record. This name may be hidden."
    },
    {
      "ordinalPosition": 13,
      "name": "ACCT_BKT_ETR_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "If the source was a claim, this field will store the procedure that updated the account level bucket."
    },
    {
      "ordinalPosition": 14,
      "name": "ACCT_IN_OUT_C",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Stores in/out of network category ID for the bucket update, as calculated by the system."
    },
    {
      "ordinalPosition": 15,
      "name": "ACCT_IN_OUT_OVRD_C",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Stores in/out of network category ID for the bucket update, if the system-calculated value was overridden."
    },
    {
      "ordinalPosition": 16,
      "name": "ACCT_BKT_HB_CHRG_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "If an accumulation amount was due to Hospital Billing, this column stores the transaction ID that caused the accumulation."
    },
    {
      "ordinalPosition": 17,
      "name": "ACCT_BKT_BKT_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "The ID of the coverage's account level bucket."
    },
    {
      "ordinalPosition": 18,
      "name": "ACCT_BKT_BKT_ID_BUCKET_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The name of the bucket."
    },
    {
      "ordinalPosition": 19,
      "name": "ACCT_BKT_CHARGE_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "If the source is a charge, then this field will have the unique ID of the charge (ETR). Hospital Billing charges (HTR) and AP claim transactions (ETR) are not stored in this column."
    },
    {
      "ordinalPosition": 20,
      "name": "ACCT_BKT_INSTANT",
      "type": "DATETIME (UTC) ",
      "discontinued": false,
      "description": "Contains the instant at which this account bucket update was made."
    },
    {
      "ordinalPosition": 21,
      "name": "ACCT_BKT_Q4_FLAG",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "A Y/N flag to indicate whether or not fourth quarter carryover was performed for this bucket line.",
      "entries": [
        "No",
        "Yes"
      ]
    },
    {
      "ordinalPosition": 22,
      "name": "ACCT_BKT_Q4_FROM_LN",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The line number of the bucket that fourth quarter accumulations were carried from."
    },
    {
      "ordinalPosition": 23,
      "name": "ACCT_BKT_Q4_RLPD_YR",
      "type": "INTEGER",
      "discontinued": false,
      "description": "Stores the roll period year of the bucket the current row corresponds to, if this bucket was carried to or from due to fourth quarter carryover."
    },
    {
      "ordinalPosition": 24,
      "name": "ACCT_BKT_ORG_SVC_DT",
      "type": "DATETIME",
      "discontinued": false,
      "description": "The original service date for the account level bucket update. This will only be different from ACCT_BKT_DATE if the bucket update was the result of carryover."
    },
    {
      "ordinalPosition": 25,
      "name": "ACCT_BKT_Q4_CAND",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "This column stores a Y/N flag. It will only be Y if the bucket is configured for fourth quarter carryover and the service date was in the last quarter of the year, but fourth quarter carryover was not performed because the member was not effective on the target bucket date.",
      "entries": [
        "No",
        "Yes"
      ]
    },
    {
      "ordinalPosition": 26,
      "name": "ACCT_BKT_Q4_CVG_YN",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Stores a Y/N flag that indicates whether or not this bucket update was carried from another coverage by fourth quarter carryover rule. The ID of the source coverage is stored in column ACCT_BKT_CVG_ID.",
      "entries": [
        "No",
        "Yes"
      ]
    },
    {
      "ordinalPosition": 27,
      "name": "ACCT_BKT_IDNT",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The user-entered identifier for a manual account bucket entry.  This is a free text field that could include a value that references an ID number, such as a claim or user ID."
    },
    {
      "ordinalPosition": 28,
      "name": "ACCT_BKT_EDIT_TYP_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The edit type category ID for the account level bucket on a coverage.",
      "entries": [
        "Accrual",
        "Payout",
        "Correction"
      ]
    },
    {
      "ordinalPosition": 29,
      "name": "ACCT_BKT_ENTRY_TTL",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "Contains the total amount in the bucket before this update. This column is only populated for rows corresponding to manual adjustments."
    },
    {
      "ordinalPosition": 30,
      "name": "ACCT_BKT_PROV_ID",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Stores the ID of the provider associated with the benefit bucket if the bucket is incremented per provider."
    },
    {
      "ordinalPosition": 31,
      "name": "ACCT_BKT_VEN_ID",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Stores the ID of the vendor associated with the benefit bucket if the bucket is incremented per vendor."
    },
    {
      "ordinalPosition": 32,
      "name": "ACCT_BKT_VEN_ID_VENDOR_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The name of the vendor."
    },
    {
      "ordinalPosition": 33,
      "name": "ACCT_BKT_ADMSN_DATE",
      "type": "DATETIME",
      "discontinued": false,
      "description": "Benefit buckets that use an admission roll period use the admission start and discharge dates from the claim to determine the roll period. Each individual accumulation stores these dates from the claim. This column stores the admission date that accumulated this particular amount to the bucket."
    },
    {
      "ordinalPosition": 34,
      "name": "ACCT_BKT_DISCHRG_DATE",
      "type": "DATETIME",
      "discontinued": false,
      "description": "Benefit buckets that use an admission roll period use the admission start and discharge dates from the claim to determine the roll period.  Each individual accumulation stores these dates from the claim.  This column stores the discharge date that accumulated this particular amount to the bucket."
    },
    {
      "ordinalPosition": 35,
      "name": "ACCT_BKT_EXCLCAROV_YN",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Stores a Y/N flag indicating whether or not this account level accumulation was excluded from carryover to other coverages. Y means this accumulation was not carried over to other coverages. N or NULL means this accumulation was not excluded from carryover."
    },
    {
      "ordinalPosition": 36,
      "name": "ACCT_BKT_CRYOVR_ORIG_AMT",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "This column stores the original amount that we attempted to carryover to this coverage. This is only set if the original amount is different than the actual amount."
    },
    {
      "ordinalPosition": 37,
      "name": "ACCT_BKT_CAT_OR_ID",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Stores the unique identifier of the record or category value used by the bucket if it is of type per extension per day. If BEN_ACCUMULATION_HX_ACCT.ACCT_BKT_ITEM is NULL, this column stores the unique identifier of a record in the INI specified by BEN_ACCUMULATION_HX_ACCT.ACCT_BKT_INI. Otherwise, this column stores the category value corresponding to the master file and item specified in those columns. If translation to community IDs (CIDs) is enabled for this deployment (e.g. in an IntraConnect setting), this column will store the category or record CID."
    },
    {
      "ordinalPosition": 38,
      "name": "ACCT_BKT_INI",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Stores the INI of the master file networked to by the bucket if it is of type per extension per day."
    },
    {
      "ordinalPosition": 39,
      "name": "ACCT_BKT_ITEM",
      "type": "INTEGER",
      "discontinued": false,
      "description": "Stores the item number networked to by the bucket if it is of type per extension per day and counts against categories."
    },
    {
      "ordinalPosition": 40,
      "name": "ACCT_BKT_COMBINED_START_DATE",
      "type": "DATETIME",
      "discontinued": false,
      "description": "Stores the combined start date used if the bucket is of type per extension per day and is using an extension to combine accumulations from two contiguous days to determine whether a bucket exceeds the limit."
    },
    {
      "ordinalPosition": 41,
      "name": "ACCT_BKT_ACCUM_ID",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Unique identifier for a single bucket accumulation. This is a machine generated value and cannot be edited. The ID is made up of three pieces: The coverage ID, the accumulation line number, and 1180. If this accumulation is carried through fourth quarter carryover a Q will be appended."
    },
    {
      "ordinalPosition": 42,
      "name": "ACCT_BKT_ORG_CVG_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "If the account-level accumulation was carried over from another coverage, then this column contains the accumulation's original source coverage ID. Otherwise, this column is blank."
    },
    {
      "ordinalPosition": 43,
      "name": "ACCT_HRA_ACC_TYPE_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The type of accumulation for the Health Reimbursement Arrangement (HRA) bucket",
      "entries": [
        "Deposit",
        "Rollover",
        "Withdrawal",
        "Proration"
      ]
    },
    {
      "ordinalPosition": 44,
      "name": "ACCT_ROLLOVER_FROM_LINE",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The line that a rollover accumulation originated on. This will not be set when the source is Health Reimbursement Arrangement (HRA) deposit."
    },
    {
      "ordinalPosition": 45,
      "name": "ACCT_REVERSAL_OF_LN",
      "type": "INTEGER",
      "discontinued": false,
      "description": "If a value is present, then this accumulation line is a reversal of the accumulation on the line number stored in this item. Note that if no value is present, then this accumulation line may or may not be a reversal of another accumulation line."
    },
    {
      "ordinalPosition": 46,
      "name": "ACCT_BKT_CROSS_ACCUM_BUCKET_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "Indicates the source bucket if the accumulation was the result of cross-accumulation."
    },
    {
      "ordinalPosition": 47,
      "name": "ACCT_BKT_CROSS_ACCUM_BUCKET_ID_BUCKET_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The name of the bucket."
    },
    {
      "ordinalPosition": 48,
      "name": "ACCT_BKT_RUNNING_TOTAL",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "Stores the running total of the bucket this line accumulated to. Roll periods are accounted for, so the amount returned is the current accumulation plus the total of previous accumulations to the same bucket and roll period."
    },
    {
      "ordinalPosition": 49,
      "name": "ACCT_BKT_TX_TOTAL_KEY",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Stores a string that uniquely identifies the coverage, bucket, and roll period this transaction applies to. This simplifies joins to other accumulation data model components, such as V_BEN_ACCUMULATION_TOTALS. COVERAGE_ID must still be included in the join."
    },
    {
      "ordinalPosition": 50,
      "name": "ACCT_BKT_SEQ_NUM",
      "type": "INTEGER",
      "discontinued": false,
      "description": "Stores a sequence number that indicates the order accumulation lines were added to the coverage. When accumulations are carried over, this number is not reset. For example, if accumulation 1 occurs on coverage A before accumulation 2 on coverage B, then carryover occurs from coverage A to B, the sequence number for accumulation 1 will still be before accumulation 2.  This sequence number is not guaranteed to be dense/continuous, and may be NULL for accumulations that occurred before its implementation."
    }
  ]
}
