{
  "name": "BEN_ACCUMULATION",
  "description": "This table is used to track accumulations to benefit buckets. \n\n\n\n\n\nTo calculate the current benefit bucket amount, join this table to BEN_ACCUMULATION_SYS_ADJ using all three primary key columns and subtracting BEN_ACCUMULATION_SYS_ADJ.SYS_ADJ_BEN_AMOUNT from BEN_ACCUMULATION.BEN_AMOUNT.",
  "primaryKey": [
    {
      "columnName": "COVERAGE_ID",
      "ordinalPosition": 1
    },
    {
      "columnName": "PAT_BUCKET_COMBO",
      "ordinalPosition": 2
    },
    {
      "columnName": "BEN_ACCUM_UNIQ_KEY",
      "ordinalPosition": 3
    }
  ],
  "columns": [
    {
      "ordinalPosition": 1,
      "name": "COVERAGE_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "This column stores the ID of the coverage record."
    },
    {
      "ordinalPosition": 2,
      "name": "PAT_BUCKET_COMBO",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "This item is only used as part of the primary key and is not useful for reporting purposes. Its purpose is to make PAT_ID part of the primary key, but still allow PAT_ID to be null. PAT_ID is null for account level buckets.  The format of this column is \"PAT_ID;CMB_ID\""
    },
    {
      "ordinalPosition": 3,
      "name": "ROLL_PRD_START",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "This column contains a numeric representation of the roll period start date for the bucket.   A bucket's roll period start value is dependent on the roll period type.  For buckets with a roll type of Calendar Year, this column contains the 4-digit year of the roll period. For buckets with a roll type of Number of Days, this column contains a numeric representation (a DAT value) of the date of the first service. For buckets with a roll type of No Roll, this column contains 99999. For buckets with a roll type of Contract Year, this column contains the 4-digit year of the contract. For buckets with a roll type of Admission, this column contains a numeric representation (a DTE value) of the admission date. For buckets with a roll type of Calendar Week, this column contains a numeric representation (a DAT value) of the first day of the weekly roll period. For buckets with a roll type of Calendar Month, this column contains a numeric representation (a DAT value) of the first day of the monthly roll period."
    },
    {
      "ordinalPosition": 4,
      "name": "PAT_ID",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The unique ID of the member this row corresponds to, or null if this is an account bucket."
    },
    {
      "ordinalPosition": 5,
      "name": "BUCKET_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "This is the bucket ID this row corresponds to."
    },
    {
      "ordinalPosition": 6,
      "name": "BUCKET_ID_BUCKET_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The name of the bucket."
    },
    {
      "ordinalPosition": 7,
      "name": "BEN_AMOUNT",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "This is the total amount currently in the bucket for this row (i.e. this coverage, patient, bucket, and roll period combination)."
    },
    {
      "ordinalPosition": 8,
      "name": "ROLL_PRD_END",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "Contains the roll period end date for the bucket. It is only populated for admission roll period buckets."
    },
    {
      "ordinalPosition": 9,
      "name": "BEN_ACCUM_UNIQ_KEY",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "This column stores a unique key that is used to identify the data row."
    },
    {
      "ordinalPosition": 10,
      "name": "BUCKET_ROLL_PERIOD_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The type of roll period the bucket uses.",
      "entries": [
        "Calendar Year",
        "Number of Days",
        "No Roll",
        "Contract Year",
        "Admission",
        "Calendar Week",
        "Calendar Month"
      ]
    },
    {
      "ordinalPosition": 11,
      "name": "CALC_ROLL_PRD_START_DATE",
      "type": "DATETIME",
      "discontinued": false,
      "description": "Except for the cases described next, this column stores the roll period start date of the bucket.  For no roll buckets (BUCKET_ROLL_PERIOD_C = 3), 12/31/1840 is stored since there is technically no roll period. For contract year buckets (BUCKET_ROLL_PERIOD_C = 4), NULL is stored since the roll period depends on employer group build that can change overtime."
    },
    {
      "ordinalPosition": 12,
      "name": "CALC_ROLL_PRD_END_DATE",
      "type": "DATETIME",
      "discontinued": false,
      "description": "Except for the cases described next, this column stores the roll period end date of the bucket.  For no roll buckets (BUCKET_ROLL_PERIOD_C = 3), 09/27/2173 is stored since there is technically no roll period. For contract year buckets (BUCKET_ROLL_PERIOD_C = 4), NULL is stored since the roll period depends on employer group build that can change overtime."
    },
    {
      "ordinalPosition": 13,
      "name": "ROLL_PRD_START_YEAR",
      "type": "INTEGER",
      "discontinued": false,
      "description": "For all bucket types, stores the start year of the roll period. For no roll buckets, 1840 is stored since there is technically no roll period. This column is most useful for calculating the roll period of contract year buckets."
    },
    {
      "ordinalPosition": 14,
      "name": "PAT_BKT_TX_TOTAL_KEY",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Stores a string that uniquely identifies the coverage, patient, bucket, and roll period this transaction applies to. It is only populated for patient-level buckets and simplifies joins to BEN_ACCUMULATION_HX_PAT. COVERAGE_ID must still be included in the join."
    }
  ]
}
