{
  "name": "BEN_ACCUMULATION_SYS_ADJ",
  "description": "This table is used to track whether any system adjustments have been performed on benefit buckets.",
  "primaryKey": [
    {
      "columnName": "COVERAGE_ID",
      "ordinalPosition": 1
    },
    {
      "columnName": "PAT_BUCKET_COMBO",
      "ordinalPosition": 2
    },
    {
      "columnName": "BEN_ACCUM_UNIQ_KEY",
      "ordinalPosition": 3
    }
  ],
  "columns": [
    {
      "ordinalPosition": 1,
      "name": "COVERAGE_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "The unique identifier of the coverage record."
    },
    {
      "ordinalPosition": 2,
      "name": "PAT_BUCKET_COMBO",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Only used as part of the primary key (not useful for reporting purposes). Makes the patient ID part of the primary key, but still allows patient ID to be null. Patient ID is null for account level buckets."
    },
    {
      "ordinalPosition": 3,
      "name": "ROLL_PRD_START",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "This column contains a numeric representation of the roll period start date for the bucket.   A bucket's roll period start value is dependent on the roll period type.  For buckets with a roll type of Calendar Year, this column contains the 4-digit year of the roll period. For buckets with a roll type of Number of Days, this column contains a numeric representation (a DAT value) of the date of the first service. For buckets with a roll type of No Roll, this column contains 99999. For buckets with a roll type of Contract Year, this column contains the 4-digit year of the contract. For buckets with a roll type of Admission, this column contains a numeric representation (a DTE value) of the admission date. For buckets with a roll type of Calendar Week, this column contains a numeric representation (a DAT value) of the first day of the weekly roll period. For buckets with a roll type of Calendar Month, this column contains a numeric representation (a DAT value) of the first day of the monthly roll period."
    },
    {
      "ordinalPosition": 4,
      "name": "PAT_ID",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The ID of the patient this row corresponds to. The value is null if the row is an account bucket."
    },
    {
      "ordinalPosition": 5,
      "name": "BUCKET_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "The unique ID of the benefit bucket this row corresponds to."
    },
    {
      "ordinalPosition": 6,
      "name": "BUCKET_ID_BUCKET_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The name of the bucket."
    },
    {
      "ordinalPosition": 7,
      "name": "SYS_ADJ_BEN_AMOUNT",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "This is the system adjusted total amount of the bucket. Negative adjustments are stored as positive values. For example, if the bucket amount is -100, this column will store 100."
    },
    {
      "ordinalPosition": 8,
      "name": "ROLL_PRD_END",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "Contains the roll period end date for the bucket. Only populated for admission roll period buckets."
    },
    {
      "ordinalPosition": 9,
      "name": "BEN_ACCUM_UNIQ_KEY",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "This column is only used as part of the primary key and is not useful for reporting purposes."
    },
    {
      "ordinalPosition": 10,
      "name": "BUCKET_ROLL_PERIOD_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The type of roll period the bucket uses.",
      "entries": [
        "Calendar Year",
        "Number of Days",
        "No Roll",
        "Contract Year",
        "Admission",
        "Calendar Week",
        "Calendar Month"
      ]
    },
    {
      "ordinalPosition": 11,
      "name": "CALC_ROLL_PRD_START_DATE",
      "type": "DATETIME",
      "discontinued": false,
      "description": "Except for the cases described next, this column stores the roll period start date of the bucket.  For no roll buckets (BUCKET_ROLL_PERIOD_C = 3), 12/31/1840 is stored since there is technically no roll period. For contract year buckets (BUCKET_ROLL_PERIOD_C = 4), NULL is stored since the roll period depends on employer group build that can change overtime."
    },
    {
      "ordinalPosition": 12,
      "name": "CALC_ROLL_PRD_END_DATE",
      "type": "DATETIME",
      "discontinued": false,
      "description": "Except for the cases described next, this column stores the roll period end date of the bucket.  For no roll buckets (BUCKET_ROLL_PERIOD_C = 3), 09/27/2173 is stored since there is technically no roll period. For contract year buckets (BUCKET_ROLL_PERIOD_C = 4), NULL is stored since the roll period depends on employer group build that can change overtime."
    },
    {
      "ordinalPosition": 13,
      "name": "ROLL_PRD_START_YEAR",
      "type": "INTEGER",
      "discontinued": false,
      "description": "For all bucket types, stores the start year of the roll period. For no roll buckets, 1840 is stored since there is technically no roll period. This column is most useful for calculating the roll period of contract year buckets."
    },
    {
      "ordinalPosition": 14,
      "name": "PAT_BKT_TX_TOTAL_KEY",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Stores a string that uniquely identifies the coverage, patient, bucket, and roll period this transaction applies to. It is only populated for patient-level buckets. The coverage ID must still be included in the join."
    }
  ]
}
