{
  "name": "BILLING_NOTIF_GUARANTOR",
  "description": "This table contains information about guarantor billing notifications.",
  "primaryKey": [
    {
      "columnName": "OUTREACH_ID",
      "ordinalPosition": 1
    },
    {
      "columnName": "CONTACT_DATE_REAL",
      "ordinalPosition": 2
    }
  ],
  "columns": [
    {
      "ordinalPosition": 1,
      "name": "OUTREACH_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "The unique identifier (.1 item) for the outreach record."
    },
    {
      "ordinalPosition": 2,
      "name": "CONTACT_DATE_REAL",
      "type": "FLOAT",
      "discontinued": false,
      "description": "A unique contact date in decimal format. The integer portion of the number indicates the date of contact while the digits after the decimal are unique and distinguish each contact on that date. For example, .00 is the first/only contact, .01 is the second contact, etc."
    },
    {
      "ordinalPosition": 3,
      "name": "CONTACT_DATE",
      "type": "DATETIME",
      "discontinued": false,
      "description": "The date of this contact in calendar format."
    },
    {
      "ordinalPosition": 4,
      "name": "OUTREACH_CSN_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "The unique contact serial number (CSN) of the associated notification in the communication record."
    },
    {
      "ordinalPosition": 5,
      "name": "HB_SELF_PAY_BAL",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "This column stores the HB self-pay balance of the guarantor when the notification was sent."
    },
    {
      "ordinalPosition": 6,
      "name": "PB_SELF_PAY_BAL",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "This column stores the PB self-pay balance of the guarantor when the notification was sent."
    },
    {
      "ordinalPosition": 7,
      "name": "TOTAL_SELF_PAY_BAL",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "This column stores the total self-pay balance of the guarantor when the notification was sent."
    },
    {
      "ordinalPosition": 8,
      "name": "HB_FULL_SELF_PAY_BAL",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "This column stores the self-pay balance of the HB hospital accounts that were fully in self-pay, and had no insurance balance when the notification was sent."
    },
    {
      "ordinalPosition": 9,
      "name": "PB_FULL_SELF_PAY_BAL",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "This column stores the self-pay balance of the PB hospital accounts/charges that were fully in self-pay, and had no insurance balance when the notification was sent."
    },
    {
      "ordinalPosition": 10,
      "name": "TOTAL_FULL_SELF_PAY_BAL",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "This column stores the total self-pay balance of HB hospital accounts and PB hospital accounts/charges that were fully in self-pay, and had no insurance balance when the notification was sent."
    },
    {
      "ordinalPosition": 11,
      "name": "PP_PROPOSED_MONTHLY_AMT",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "If the guarantor meets the restrictions for setting up payment plans from MyChart, this column will store the proposed monthly amount that will be shown if they were to sign up for a payment plan. If eligible, the payment plan proposals will be included in statement, balance update, and payment reminder notification."
    },
    {
      "ordinalPosition": 12,
      "name": "PP_PROPOSED_NUM_PMTS",
      "type": "INTEGER",
      "discontinued": false,
      "description": "If the guarantor meets the restrictions for setting up payment plans from MyChart, this column will store the proposed number of payments that will be shown if they were to sign up for a payment plan. If eligible, the payment plan proposals will be included in statement, balance update, and payment reminder notification."
    },
    {
      "ordinalPosition": 13,
      "name": "HB_NON_PMT_PLAN_BAL",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "If the guarantor is on a HB/SBO payment plan, this column stores the self-pay balance that is not on a payment plan. If the guarantor is not on a payment plan, this column will store the total self-pay balance of the notification line."
    },
    {
      "ordinalPosition": 14,
      "name": "ACTION_AMT",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "This column stores the amount the guarantor is able to take a payment action on at the time the notification was sent. For example, a guarantor using Two-Way via SMS to pay off their payment plan due."
    }
  ]
}
