{
  "name": "CLM_ADJ_RSN_CD",
  "description": "This table holds the claim adjustment reason code information for the claim.  Each record holds the set of reason codes and amounts for one coverage at either the claim or service line level.",
  "primaryKey": [
    {
      "columnName": "RECORD_ID",
      "ordinalPosition": 1
    },
    {
      "columnName": "LINE",
      "ordinalPosition": 2
    }
  ],
  "columns": [
    {
      "ordinalPosition": 1,
      "name": "RECORD_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "The unique identifier for the Claim Info record."
    },
    {
      "ordinalPosition": 2,
      "name": "LINE",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The line number for the information associated with this contact. Multiple pieces of information can be associated with this contact."
    },
    {
      "ordinalPosition": 3,
      "name": "CAS_GRP_CD",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "This item holds the group code for a claim adjustment reason code. Group codes from both claim level and line level adjustments will be stored in this item."
    },
    {
      "ordinalPosition": 4,
      "name": "CAS_RSN_CD",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "This item holds a claim adjustment reason code. Both claim level and line level reason codes will be stored in this item."
    },
    {
      "ordinalPosition": 5,
      "name": "CAS_AMT",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "This item holds the amount for a claim adjustment reason code. Amounts from both claim level and line level adjustments will be stored in this item."
    },
    {
      "ordinalPosition": 6,
      "name": "CAS_QTY",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "This item holds the quantity for a claim adjustment reason code. Quantities from both claim level and line level adjustments will be stored in this item."
    },
    {
      "ordinalPosition": 7,
      "name": "BB_AMT_TYPE",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The Uniform Resource Identifier (URI) provided by the Beneficiary Claims Data API (BCDA), for determining the adjudication amount type."
    }
  ]
}
