{
  "name": "COMP_RX_FMT_HX",
  "description": "This table contains the history of formatted prescription numbers for each component in an Intelligent Medication Selection (IMS) tab mixture in Long Term Care (including the current active formatted prescription number).",
  "primaryKey": [
    {
      "columnName": "ORDER_ID",
      "ordinalPosition": 1
    },
    {
      "columnName": "CONTACT_DATE_REAL",
      "ordinalPosition": 2
    },
    {
      "columnName": "LINE",
      "ordinalPosition": 3
    }
  ],
  "columns": [
    {
      "ordinalPosition": 1,
      "name": "ORDER_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "The unique identifier for the order record."
    },
    {
      "ordinalPosition": 2,
      "name": "CONTACT_DATE_REAL",
      "type": "FLOAT",
      "discontinued": false,
      "description": "A unique contact date in decimal format. The integer portion of the number indicates the date of contact. The digits after the decimal distinguish different contacts on the same date and are unique for each contact on that date. For example, .00 is the first/only contact, .01 is the second contact, etc."
    },
    {
      "ordinalPosition": 3,
      "name": "LINE",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The line number for the information associated with this contact. Multiple pieces of information can be associated with this contact."
    },
    {
      "ordinalPosition": 4,
      "name": "CONTACT_DATE",
      "type": "DATETIME",
      "discontinued": false,
      "description": "The date of this contact in calendar format."
    },
    {
      "ordinalPosition": 5,
      "name": "COMP_RX_FMT_HX",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The historical list of the formatted prescription numbers for each of the components of an intelligent medication selection (IMS) tab mixture in Long Term Care. An IMS tab mixture is a combination of solid form medications (i.e. tablets, capsules) of varying strengths, chosen to fulfill an order's required strength while using the least amount of tablets."
    }
  ]
}
