{
  "name": "COMP_ASMT_FORMS",
  "description": "The COMP_ASMT_FORMS table contains information about which forms within the hospice comprehensive assessment were documented or updated during a given contact. This table includes who documented the form and at what time.",
  "primaryKey": [
    {
      "columnName": "PAT_ENC_CSN_ID",
      "ordinalPosition": 1
    },
    {
      "columnName": "LINE",
      "ordinalPosition": 2
    }
  ],
  "columns": [
    {
      "ordinalPosition": 1,
      "name": "PAT_ENC_CSN_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "The unique contact serial number for this contact. This number is unique across all patient encounters in your system. If you use IntraConnect, this is the Unique Contact Identifier (UCI)."
    },
    {
      "ordinalPosition": 2,
      "name": "LINE",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The line number for the information associated with this contact. Multiple pieces of information can be associated with this contact."
    },
    {
      "ordinalPosition": 3,
      "name": "PAT_ENC_DATE_REAL",
      "type": "FLOAT",
      "discontinued": false,
      "description": "A unique contact date in decimal format. The integer portion of the number indicates the date of contact. The digits after the decimal distinguish different contacts on the same date and are unique for each contact on that date. For example, .00 is the first/only contact, .01 is the second contact, etc."
    },
    {
      "ordinalPosition": 4,
      "name": "CONTACT_DATE",
      "type": "DATETIME",
      "discontinued": false,
      "description": "The date of this contact in calendar format."
    },
    {
      "ordinalPosition": 5,
      "name": "CM_CT_OWNER_ID",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The Community ID (CID) of the instance that owns this contact. This is only populated if you use IntraConnect."
    },
    {
      "ordinalPosition": 6,
      "name": "COMP_ASMT_FORM_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "This item stores which comprehensive assessment forms were updated in each visit."
    },
    {
      "ordinalPosition": 7,
      "name": "COMP_ASMT_UPDT_DTTM",
      "type": "DATETIME (UTC) ",
      "discontinued": false,
      "description": "This item stores the instant at which a given form in the comprehensive assessment was updated."
    },
    {
      "ordinalPosition": 8,
      "name": "CA_UPDATE_USER_ID",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The user record ID of the user who documented this comprehensive assessment form in this contact."
    },
    {
      "ordinalPosition": 9,
      "name": "CA_UPDATE_USER_ID_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The name of the user record. This name may be hidden."
    },
    {
      "ordinalPosition": 10,
      "name": "ASMT_FORM_DATE_REAL",
      "type": "FLOAT",
      "discontinued": false,
      "description": "A unique, internal contact date of the comprehensive assessment forms updated during each visit in decimal format. Use this value to determine which version of the contact form was used in the contact."
    }
  ]
}
