{
  "name": "CW_ABST_PAT_ATTEST",
  "description": "Pain and clinical depression assessment information from abstractions with clinical information reported to the United States ESRD patient registry.",
  "primaryKey": [
    {
      "columnName": "REGISTRY_DATA_ID",
      "ordinalPosition": 1
    }
  ],
  "columns": [
    {
      "ordinalPosition": 1,
      "name": "REGISTRY_DATA_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "The unique identifier for the registry data record."
    },
    {
      "ordinalPosition": 2,
      "name": "PAIN_ASSESS_TIME_PERIOD_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The start and end dates of the dialysis patient's pain assessment time period.",
      "entries": [
        "01/01/2016 - 06/30/2016",
        "07/01/2016 - 12/31/2016",
        "01/01/2017 - 06/30/2017",
        "07/01/2017 - 12/31/2017",
        "01/01/2018 - 06/30/2018",
        "07/01/2018 - 12/31/2018",
        "01/01/2019 - 06/30/2019",
        "07/01/2019 - 12/31/2019",
        "01/01/2020 - 06/30/2020",
        "07/01/2020 - 12/31/2020"
      ]
    },
    {
      "ordinalPosition": 3,
      "name": "PAIN_ASSESS_DOC_STATUS_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The dialysis patient's pain assessment documentation status.",
      "entries": [
        "Pain assessment using a standardized tool is documented as positive and a follow-up plan is documented",
        "Pain assessment documented as positive, a follow-up plan is not documented and the facility possesses documentation that patient is not eligible",
        "Pain assessment documented as positive using a standardized tool, a follow-up plan is not documented and no reason is given",
        "Pain assessment using a standardized tool is documented as negative and no follow-up plan required",
        "No documentation of pain assessment and the facility possesses documentation the patient is not eligible for pain assessment using a standardized tool",
        "No documentation of pain assessment and no reason given"
      ]
    },
    {
      "ordinalPosition": 4,
      "name": "DEPRESS_ASSESS_TIME_PERIOD_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The start and end dates of the dialysis patient's clinical depression assessment time period.",
      "entries": [
        "01/01/2016 - 12/31/2016",
        "01/01/2017 - 12/31/2017",
        "01/01/2018 - 12/31/2018",
        "01/01/2019 - 12/31/2019",
        "01/01/2020 - 12/31/2020",
        "01/01/2021 - 12/31/2021",
        "01/01/2022 - 12/31/2022",
        "01/01/2023 - 12/31/2023",
        "01/01/2024 - 12/31/2024",
        "01/01/2025 - 12/31/2025",
        "01/01/2026 - 12/31/2026",
        "01/01/2027 - 12/31/2027",
        "01/01/2028 - 12/31/2028",
        "01/01/2029 - 12/31/2029",
        "01/01/2030 - 12/31/2030"
      ]
    },
    {
      "ordinalPosition": 5,
      "name": "DEPRESS_ASSESS_DOC_STATUS_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The dialysis patient's clinical depression assessment documentation status.",
      "entries": [
        "Screening for clinical depression is documented as being positive, and a follow-up plan is documented",
        "Screening for clinical depression documented as positive, and a follow-up plan not documented, and the facility possess documentation stating the patient is not eligible",
        "Screening for clinical depression documented as positive, the facility possesses no documentation of a follow-up plan, and no reason is given",
        "Screening for clinical depression is documented as negative, and a follow-up plan is not required",
        "Screening for clinical depression not documented, but the facility possesses documentation stating the patient is not eligible",
        "Clinical depression screening not documented, and no reason is given"
      ]
    }
  ]
}
