{
  "name": "DOCS_RCVD_INTRECIP",
  "description": "The DOCS_RCVD_INTRECIP table contains information about the intended recipients to whom a given document from an external system was addressed.",
  "primaryKey": [
    {
      "columnName": "DOCUMENT_ID",
      "ordinalPosition": 1
    },
    {
      "columnName": "CONTACT_DATE_REAL",
      "ordinalPosition": 2
    },
    {
      "columnName": "LINE",
      "ordinalPosition": 3
    }
  ],
  "columns": [
    {
      "ordinalPosition": 1,
      "name": "DOCUMENT_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "This item stores the Received Document record ID."
    },
    {
      "ordinalPosition": 2,
      "name": "CONTACT_DATE_REAL",
      "type": "FLOAT",
      "discontinued": false,
      "description": "A unique contact date in decimal format. The integer portion of the number indicates the date of contact. The digits after the decimal distinguish different contacts on the same date and are unique for each contact on that date. For example, .00 is the first/only contact, .01 is the second contact, etc."
    },
    {
      "ordinalPosition": 3,
      "name": "LINE",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The line number for the information associated with this contact. Multiple pieces of information can be associated with this contact."
    },
    {
      "ordinalPosition": 4,
      "name": "INTENDED_RECIP_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "When a submission set is received from an external system, it contains certain metadata supplied by the sending system regarding the document. This column contains the name of the intended recipient for a received message."
    },
    {
      "ordinalPosition": 5,
      "name": "INTENDED_RECIP_ADDR",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "When a submission set is received from an external system, it contains certain metadata supplied by the sending system regarding the document. This column contains the Direct address of an intended recipient for a received message."
    },
    {
      "ordinalPosition": 6,
      "name": "INTEND_RECIP_EMP_ID",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Intended recipient employee ID column. When a submission set is received from an external system, it will contain certain metadata supplied by the sending system regarding the document. This column contains the employee ID for the intended recipient supplied in a received message, if one can be resolved."
    },
    {
      "ordinalPosition": 7,
      "name": "INTEND_RECIP_EMP_ID_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The name of the user record. This name may be hidden."
    },
    {
      "ordinalPosition": 8,
      "name": "INTEND_RECIP_HIP_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "Intended recipient In Basket Pool ID column. When a submission set is received from an external system, it will contain certain metadata supplied by the sending system regarding the document. This column contains the registry ID for the intended recipient supplied in a received message, if one can be resolved."
    },
    {
      "ordinalPosition": 9,
      "name": "INTEND_RECIP_HIP_ID_REGISTRY_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The name of the In Basket registry in the HIP master file."
    },
    {
      "ordinalPosition": 10,
      "name": "RECPT_ACCESS_TYPE_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "This is a category value that indicates whether the intended recipient of a summary of care document is an EpicCare Link user, a Hyperspace user, or both.",
      "entries": [
        "EpicCare Link",
        "Hyperspace",
        "EpicCare Link and Hyperspace"
      ]
    },
    {
      "ordinalPosition": 11,
      "name": "RECPT_PHY_ADDR",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "This item stores the physical address of the intended recipient."
    },
    {
      "ordinalPosition": 12,
      "name": "RECPT_PHONE",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "This item stores the phone number of the intended recipient."
    },
    {
      "ordinalPosition": 13,
      "name": "INTEND_RECIP_EAF_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "Intended recipient facility ID column. When a submission set is received from an external system, it will contain certain metadata supplied by the sending system regarding the document. This column contains the facility ID  for the intended recipient supplied in a received message, if one can be resolved."
    }
  ]
}
