{
  "name": "DOCS_RCVD_AUTHADDR",
  "description": "The DOCS_RCVD_AUTHADDR table contains information about the Direct Address of the author(s) by whom a given document was created.",
  "primaryKey": [
    {
      "columnName": "DOCUMENT_ID",
      "ordinalPosition": 1
    },
    {
      "columnName": "CONTACT_DATE_REAL",
      "ordinalPosition": 2
    },
    {
      "columnName": "LINE",
      "ordinalPosition": 3
    }
  ],
  "columns": [
    {
      "ordinalPosition": 1,
      "name": "DOCUMENT_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "This item stores the Received Document record ID."
    },
    {
      "ordinalPosition": 2,
      "name": "CONTACT_DATE_REAL",
      "type": "FLOAT",
      "discontinued": false,
      "description": "A unique contact date in decimal format. The integer portion of the number indicates the date of contact. The digits after the decimal distinguish different contacts on the same date and are unique for each contact on that date. For example, .00 is the first/only contact, .01 is the second contact, etc."
    },
    {
      "ordinalPosition": 3,
      "name": "LINE",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The line number for the information associated with this contact. Multiple pieces of information can be associated with this contact."
    },
    {
      "ordinalPosition": 4,
      "name": "CONTACT_DATE",
      "type": "DATETIME",
      "discontinued": false,
      "description": "The date of this contact in calendar format."
    },
    {
      "ordinalPosition": 5,
      "name": "AUTHOR_ADDR",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Author Addresses column. When a document is received from an external system, it will contain certain metadata supplied by the sending system regarding the document. This column contains the Direct addresses of the authors that were received in the document's metadata."
    },
    {
      "ordinalPosition": 6,
      "name": "AUTHOR_DXA_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "Author Direct audit (DXA) ID column. When a document is received from an external system, it will contain certain metadata supplied by the sending system regarding the document. This column contains the Direct audit (DXA) record ID of the author that was received in the document's metadata."
    },
    {
      "ordinalPosition": 7,
      "name": "AUTHOR_DXA_ID_MIXED_DIRECT_ADDR",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Formatted like an email address, this is how Direct messaging knows where to send a message. This item is stored in mixed case to use in display in addressing."
    }
  ]
}
