{
  "name": "EM_CODE_CALC",
  "description": "Tracks Evaluation and Management (EM) code calculations based on LOS codes. EM codes are used by physicians to report and bill medical services depending on medical history, physical examinations and the level of medical decision making. This table also tracks the source of EM codes - if they were entered manually or via documentation.",
  "primaryKey": [
    {
      "columnName": "PAT_ENC_CSN_ID",
      "ordinalPosition": 1
    },
    {
      "columnName": "LINE",
      "ordinalPosition": 2
    }
  ],
  "columns": [
    {
      "ordinalPosition": 1,
      "name": "PAT_ENC_CSN_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "The unique contact serial number for this contact. This number is unique across all patient encounters in your system. If you use IntraConnect, this is the Unique Contact Identifier (UCI)."
    },
    {
      "ordinalPosition": 2,
      "name": "LINE",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The line number for the EM code associated with this contact. Multiple pieces of information can be associated with this contact."
    },
    {
      "ordinalPosition": 3,
      "name": "PAT_ENC_DATE_REAL",
      "type": "FLOAT",
      "discontinued": false,
      "description": "A unique contact date in decimal format. The integer portion of the number indicates the date of contact. The digits after the decimal distinguish different contacts on the same date and are unique for each contact on that date. For example, .00 is the first/only contact, .01 is the second contact, etc."
    },
    {
      "ordinalPosition": 4,
      "name": "CONTACT_DATE",
      "type": "DATETIME",
      "discontinued": false,
      "description": "The date of this contact in calendar format."
    },
    {
      "ordinalPosition": 5,
      "name": "EM_CODE_SECTION",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The section of the patient's chart used to calculate the EM code. Ex: Review of Systems (ROS) or History of Present Illness (HPI)"
    },
    {
      "ordinalPosition": 6,
      "name": "EM_CODE_ATTRIBUTE",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The attribute of the section of the chart used to calculate the EM code. Ex: A Neuro or GI section in the Review of Systems (ROS)"
    },
    {
      "ordinalPosition": 7,
      "name": "EMCODE_ASSO_NOTE_ID",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Stores the note record ID corresponding to the note where this EM code was filed."
    },
    {
      "ordinalPosition": 8,
      "name": "EMCODE_SDI",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "This item stores the source SmartData Element Identifier (discrete piece of data) for the current line of EM code."
    },
    {
      "ordinalPosition": 9,
      "name": "EM_CODE_SOURCE_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "This item tracks if a particular EM Code was filed manually (not automatically via documentation) and which manual source filed this code.",
      "entries": [
        "LOS Tree"
      ]
    },
    {
      "ordinalPosition": 10,
      "name": "EM_CODE",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The EM code value used to calculate level of service"
    }
  ]
}
