{
  "name": "EPA_SELECT_CHOICES",
  "description": "This table holds the select choices for electronic prior authorization questions.",
  "primaryKey": [
    {
      "columnName": "REFERRAL_ID",
      "ordinalPosition": 1
    },
    {
      "columnName": "LINE",
      "ordinalPosition": 2
    }
  ],
  "columns": [
    {
      "ordinalPosition": 1,
      "name": "REFERRAL_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "The unique identifier for the referral record."
    },
    {
      "ordinalPosition": 2,
      "name": "LINE",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The line number for the information associated with this record. Multiple pieces of information can be associated with this record."
    },
    {
      "ordinalPosition": 3,
      "name": "SEL_CHOICE_ID",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "This item holds the ID of the multiple choice option for electronic prior authorization."
    },
    {
      "ordinalPosition": 4,
      "name": "SEL_CHOICE_SEQUENCE",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "This item holds the sequence for the multiple choice option."
    },
    {
      "ordinalPosition": 5,
      "name": "ALLOW_FREE_TEXT_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Indicates whether a free text comment was allowed for the multiple choice option. If set to No, free text comments will not be allowed. If set to Yes-Required, a free text comment will be required. If set to Yes-Optional, a free text comment will be allowed, but optional.",
      "entries": [
        "No",
        "Yes - Required",
        "Yes - Optional"
      ]
    },
    {
      "ordinalPosition": 6,
      "name": "SEL_QUESN_NEXT_ID",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "This item holds the ID of the next question if this answer choice is selected."
    },
    {
      "ordinalPosition": 7,
      "name": "SEL_CODE_REF_START",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This item holds the line number of the first coded reference detail line associated with this electronic prior authorization multiple choice option. The actual coded reference details are stored in referral file (RFL) related group 9390."
    },
    {
      "ordinalPosition": 8,
      "name": "SEL_CODE_REF_END",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This item holds the line number of the last coded reference detail line associated with this electronic prior authorization multiple choice option. The actual coded reference details are stored in referral file (RFL) related group 9390."
    },
    {
      "ordinalPosition": 9,
      "name": "SEL_CHOICE_VALUE_YN",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "This item holds whether this selection option was chosen. If it is set to 1-Yes, it indicates that the answer was selected. If it is set to null or 0-No, it indicates that the answer was not selected.",
      "entries": [
        "No",
        "Yes"
      ]
    }
  ]
}
