{
  "name": "EPA_INFO",
  "description": "This table holds information about electronic prior authorization requests.",
  "primaryKey": [
    {
      "columnName": "REFERRAL_ID",
      "ordinalPosition": 1
    }
  ],
  "columns": [
    {
      "ordinalPosition": 1,
      "name": "REFERRAL_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "The unique identifier for the referral record."
    },
    {
      "ordinalPosition": 2,
      "name": "EPA_REF_ID",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "This item holds the reference ID for electronic prior authorization. It is generated by the system and used for linking a referral record to an electronic prior authorization message.  This value will not change during an electronic prior authorization interaction."
    },
    {
      "ordinalPosition": 3,
      "name": "PA_PAT_NOTIFIED_YN",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "This item specifies whether the patient has been notified about the status of the prior authorization.",
      "entries": [
        "Yes",
        "No"
      ]
    },
    {
      "ordinalPosition": 4,
      "name": "PA_APPROVAL_SRC_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "This item records the entry source of the outpatient prescription prior authorization details. If an authorization was completed using both electronic and manual entry, this will be based on how the most recent data was entered.",
      "entries": [
        "Electronic",
        "Manual"
      ]
    },
    {
      "ordinalPosition": 5,
      "name": "MED_EPA_UPD_UTC_DTTM",
      "type": "DATETIME (UTC) ",
      "discontinued": false,
      "description": "This holds the instant that ePA information was last updated on this referral."
    },
    {
      "ordinalPosition": 6,
      "name": "EPA_RFL_ORD_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "This virtual item holds the order ID associated with an outpatient prescription medication prior authorization request."
    },
    {
      "ordinalPosition": 7,
      "name": "PAT_EPA_ENC_CSN_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "This item holds the CSN of the encounter the prior authorization was requested in."
    },
    {
      "ordinalPosition": 8,
      "name": "EPA_PHR_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "This item stores the pharmacy that initiated prior authorization."
    },
    {
      "ordinalPosition": 9,
      "name": "EPA_PHR_ID_PHARMACY_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The name of the pharmacy."
    },
    {
      "ordinalPosition": 10,
      "name": "EPA_REQ_TYPE_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "This item records the type of the outpatient prescription prior authorization request.  1-Prospective is a request that was initiated at the time of signing the order. 2-Retrospective is a request that was initiated after the order was signed. 3-Retrospective-RxChange is a retrospective request that was initiated by an electronic RxChange message from the pharmacy. 4-Renewal is a request that was initiated on a signed order that already had a prior authorization request linked to it. 5-Renewal-RxChange is a renewal that was initiated by an electronic RxChange message from the pharmacy. 6-Retrospective-Willow Ambulatory is a retrospective request that was initiated from within the Willow Ambulatory application. 7-Renewal-Willow Ambulatory is a renewal that was initiated from within the Willow Ambulatory application.",
      "entries": [
        "Prospective",
        "Retrospective",
        "Retrospective-RxChange",
        "Renewal",
        "Renewal-RxChange",
        "Retrospective-Willow Ambulatory",
        "Renewal-Willow Ambulatory",
        "Renewal-Payer"
      ]
    },
    {
      "ordinalPosition": 11,
      "name": "CUR_EPA_STATUS_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "This item holds the current status of the outpatient prescription prior authorization request.",
      "entries": [
        "Approved",
        "Denied",
        "Canceled",
        "Appeal Approved",
        "Appeal Denied",
        "Payer Waiting for Response",
        "Waiting for Payer Response",
        "Waiting for Auth Details",
        "Closed",
        "Error"
      ]
    },
    {
      "ordinalPosition": 12,
      "name": "EPA_HRS_FINAL_STAT",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This column holds the numbers of hours that the outpatient prescription prior authorization request was in progress.  For requests that were initiated, but no other actions have taken place, the count returned will be 0. For other requests, the count returned will be the hours between the initiation of the request and the last action performed on the request."
    }
  ]
}
