{
  "name": "EPA_QUESTIONS",
  "description": "This table holds the questions for an electronic prior authorization interaction.",
  "primaryKey": [
    {
      "columnName": "REFERRAL_ID",
      "ordinalPosition": 1
    },
    {
      "columnName": "LINE",
      "ordinalPosition": 2
    }
  ],
  "columns": [
    {
      "ordinalPosition": 1,
      "name": "REFERRAL_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "The unique identifier for the referral record."
    },
    {
      "ordinalPosition": 2,
      "name": "LINE",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The line number for the information associated with this record. Multiple pieces of information can be associated with this record."
    },
    {
      "ordinalPosition": 3,
      "name": "QUESN_ID",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "This item holds the ID of the electronic prior authorization question."
    },
    {
      "ordinalPosition": 4,
      "name": "QUESN_SEQUENCE_NUM",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "The item holds the sequence number for the electronic prior authorization question."
    },
    {
      "ordinalPosition": 5,
      "name": "QUESN_LEVEL",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "This item holds the question level for the electronic prior authorization question."
    },
    {
      "ordinalPosition": 6,
      "name": "DFLT_NEXT_QUESN",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "This item holds the ID of the default next question to show after this question."
    },
    {
      "ordinalPosition": 7,
      "name": "QUESN_TYPE_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "This item holds the type of question for electronic prior authorization.",
      "entries": [
        "Select",
        "Date",
        "Numeric",
        "Free Text"
      ]
    },
    {
      "ordinalPosition": 8,
      "name": "SEL_QUES_START_LINE",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This item holds the line number of the first select question detail line associated with this electronic prior authorization question. The actual select question details are stored in referral file (RFL) related group 9350."
    },
    {
      "ordinalPosition": 9,
      "name": "SEL_QUESN_END_LINE",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This item holds the line number of the last select question detail line associated with this electronic prior authorization question. The actual select question details are stored in referral file (RFL) related group 9350."
    },
    {
      "ordinalPosition": 10,
      "name": "DT_QUESN_REQ_TM_YN",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "This item indicates if a time is required for an electronic prior authorization date question.",
      "entries": [
        "No",
        "Yes"
      ]
    },
    {
      "ordinalPosition": 11,
      "name": "NUM_CMP_START_LINE",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This item holds the line number of the first conditional comparison detail line associated with this electronic prior authorization question. The actual conditional comparison details are stored in RFL related group 9340."
    },
    {
      "ordinalPosition": 12,
      "name": "NUM_CMP_END_LINE",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This item holds the line number of the last conditional comparison detail line associated with this electronic prior authorization question. The actual conditional comparison details are stored in RFL related group 9340."
    },
    {
      "ordinalPosition": 13,
      "name": "CODE_REF_START_LINE",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This item holds the line number of the first coded reference detail line associated with this electronic prior authorization question. The actual coded reference details are stored in referral file (RFL) related group 9390."
    },
    {
      "ordinalPosition": 14,
      "name": "CODE_REF_END_LINE",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This item holds the line number of the last coded reference detail line associated with this electronic prior authorization question. The actual coded reference details are stored in referral file (RFL) related group 9390."
    },
    {
      "ordinalPosition": 15,
      "name": "SEL_QUES_MULT_YN",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "This item holds whether multiple answers can be selected for selection questions."
    }
  ]
}
