{
  "name": "HH_OASIS_ICD10_DX",
  "description": "This table contains all of the clinical Outcome and Assessment Information Set (OASIS) ICD-10 diagnoses entered by a field nurse and edited in Diagnosis Review. The first diagnosis for a given patient encounter is the primary diagnosis. The next 5 are the diagnoses that will go on the OASIS submission. Anything after the sixth diagnosis for a given encounter is merely reportable.",
  "primaryKey": [
    {
      "columnName": "PAT_ENC_CSN_ID",
      "ordinalPosition": 1
    },
    {
      "columnName": "LINE",
      "ordinalPosition": 2
    }
  ],
  "columns": [
    {
      "ordinalPosition": 1,
      "name": "PAT_ENC_CSN_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "The unique contact serial number for this contact. This number is unique across all patient encounters in your system. If you use IntraConnect, this is the Unique Contact Identifier (UCI)."
    },
    {
      "ordinalPosition": 2,
      "name": "LINE",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The line number for the information associated with this contact. Multiple pieces of information can be associated with this contact."
    },
    {
      "ordinalPosition": 3,
      "name": "PAT_ENC_DATE_REAL",
      "type": "FLOAT",
      "discontinued": false,
      "description": "A unique contact date in decimal format. The integer portion of the number indicates the date of contact. The digits after the decimal distinguish different contacts on the same date and are unique for each contact on that date. For example, .00 is the first/only contact, .01 is the second contact, etc."
    },
    {
      "ordinalPosition": 4,
      "name": "CONTACT_DATE",
      "type": "DATETIME",
      "discontinued": false,
      "description": "The date of this contact in calendar format."
    },
    {
      "ordinalPosition": 5,
      "name": "CM_CT_OWNER_ID",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The Community ID (CID) of the instance that owns this contact. This is only populated if you use IntraConnect."
    },
    {
      "ordinalPosition": 6,
      "name": "OASIS_DX_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "M1021 Primary Diagnosis is stored in line 1, and M1023 Other Diagnoses are stored in lines 2-6."
    },
    {
      "ordinalPosition": 7,
      "name": "OASIS_DX_START_DATE",
      "type": "DATETIME",
      "discontinued": false,
      "description": "Start date of M1021 and M1023 diagnoses."
    },
    {
      "ordinalPosition": 8,
      "name": "OASIS_DX_SCR_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The category number for the symptom control rating for M1021 and M1023. This is usually the same as the internal ID. If you use IntraConnect, this is the Community ID (CID)",
      "entries": [
        "Asymptomatic, no treatment needed at this time",
        "Symptoms well controlled with current therapy",
        "Symptoms controlled with difficulty, affecting daily functioning; patient needs ongoing monitoring",
        "Symptoms poorly controlled; patient needs frequent adjustment in treatment and dose monitoring",
        "Symptoms poorly controlled; history of re-hospitalizations"
      ]
    },
    {
      "ordinalPosition": 9,
      "name": "OASIS_DX_FLAG_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The Flag item is a customer defined category list that can be used to further describe a diagnosis entry. An example of the use of this item would be for flagging a diagnosis as an exacerbation or onset. The flag will be carried over to the plan of care."
    },
    {
      "ordinalPosition": 10,
      "name": "OASIS_DX_OTHER_1_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "This column stores the first of two optional diagnoses if the diagnosis code in M1021/M1023 is a Z-code."
    },
    {
      "ordinalPosition": 11,
      "name": "OASIS_DX_OTHER_2_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "This column stores the second of two optional diagnoses if the diagnosis code in M1021/M1023 is a Z-code."
    }
  ]
}
