{
  "name": "HH_PAT_CASE_MIX_DX",
  "description": "This table contains Primary and Secondary case mix diagnoses information entered for a patient as part of a home health Outcome and Assessment Information Set (OASIS) assessment. The table stores values entered for M0246 for the Primary diagnosis for the contact.",
  "primaryKey": [
    {
      "columnName": "PAT_ENC_CSN_ID",
      "ordinalPosition": 1
    },
    {
      "columnName": "LINE",
      "ordinalPosition": 2
    }
  ],
  "columns": [
    {
      "ordinalPosition": 1,
      "name": "PAT_ENC_CSN_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "The unique contact serial number for this contact. This number is unique across all patient encounters in your system. If you use IntraConnect, this is the Unique Contact Identifier (UCI)."
    },
    {
      "ordinalPosition": 2,
      "name": "LINE",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The line number for the information associated with this record. Multiple pieces of information can be associated with this record."
    },
    {
      "ordinalPosition": 3,
      "name": "PAT_ENC_DATE_REAL",
      "type": "FLOAT",
      "discontinued": false,
      "description": "This column stores a numeric representation of the date of this encounter in your system. The integer portion of the number specifies the date of the encounter. The digits after the decimal point indicate multiple visits on one day."
    },
    {
      "ordinalPosition": 4,
      "name": "CONTACT_DATE",
      "type": "DATETIME",
      "discontinued": false,
      "description": "This column stores the contact date."
    },
    {
      "ordinalPosition": 5,
      "name": "CM_CT_OWNER_ID",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The Community ID (CID) of the instance that owns this contact. This is populated only if you use IntraConnect."
    },
    {
      "ordinalPosition": 6,
      "name": "CASE_MIX_DX_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "This column stores the Primary Case Mix Diagnoses entered as part of a home health assessment as defined by M0246."
    },
    {
      "ordinalPosition": 7,
      "name": "SEC_CASE_DX_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "This column stores the Secondary Case Mix Diagnoses entered as part of a home health assessment as defined by M0246."
    }
  ]
}
