{
  "name": "HH_PAT_IP_PROC",
  "description": "This table extracts the HH OASIS M1012 - Inpatient Procedures (I EPT 27507) item, which holds the responses to M1012 (Inpatient Procedures) from Home Health OASIS assessments.",
  "primaryKey": [
    {
      "columnName": "PAT_ENC_CSN_ID",
      "ordinalPosition": 1
    },
    {
      "columnName": "LINE",
      "ordinalPosition": 2
    }
  ],
  "columns": [
    {
      "ordinalPosition": 1,
      "name": "PAT_ENC_CSN_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "The unique contact serial number for this contact. This number is unique across all patient encounters in your system. If you use IntraConnect, this is the Unique Contact Identifier (UCI)."
    },
    {
      "ordinalPosition": 2,
      "name": "LINE",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The line number for the information associated with this contact. Multiple pieces of information can be associated with this contact."
    },
    {
      "ordinalPosition": 3,
      "name": "PAT_ENC_DATE_REAL",
      "type": "FLOAT",
      "discontinued": false,
      "description": "A unique contact date in decimal format. The integer portion of the number indicates the date of contact. The digits after the decimal distinguish different contacts on the same date and are unique for each contact on that date. For example, .00 is the first/only contact, .01 is the second contact, etc."
    },
    {
      "ordinalPosition": 4,
      "name": "CONTACT_DATE",
      "type": "DATETIME",
      "discontinued": false,
      "description": "The date of this contact in calendar format."
    },
    {
      "ordinalPosition": 5,
      "name": "CM_CT_OWNER_ID",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The Community ID (CID) of the instance that owns this contact. This is populated only if you use IntraConnect."
    },
    {
      "ordinalPosition": 6,
      "name": "IP_ICD_PROC_ID",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "This column holds the responses to question M1012 in Home Health OASIS assessments. The instructions for completing this OASIS question are: \"List each Inpatient Procedure and the associated ICD-9-CM procedure code relevant to the plan of care.\""
    },
    {
      "ordinalPosition": 7,
      "name": "IP_ICD_PROC_ID_ICD_PX_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The name of the ICD procedure record."
    }
  ]
}
