{
  "name": "HSP_CLAIM_XR_VARS",
  "description": "This table contains the values used by contract pricing extensions for calculating expected reimbursement.",
  "primaryKey": [
    {
      "columnName": "CLAIM_PRINT_ID",
      "ordinalPosition": 1
    }
  ],
  "columns": [
    {
      "ordinalPosition": 1,
      "name": "CLAIM_PRINT_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "This column stores the unique identifier for the claim print record."
    },
    {
      "ordinalPosition": 2,
      "name": "COST_OUT_PMT_TOTAL",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "This column stores the outlier payment amount for the claim for use in claims printing. This is used for inpatient claims sent to the Health Authority of Abu Dhabi that are paid by diagnosis-related group (DRG)."
    },
    {
      "ordinalPosition": 3,
      "name": "COST_OUT_PMT_CAND",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "The cost outlier payment total for a claim that does not include a cost outlier in its expected reimbursement amount calculation but that may be a candidate for a cost outlier."
    },
    {
      "ordinalPosition": 4,
      "name": "IMPLANT_PMT_TOTAL",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "This item tracks the expected reimbursement for implants.  This data must be stored using a contracts pricing programming point that specifically updates this item."
    },
    {
      "ordinalPosition": 5,
      "name": "PHY_TRANS_PMT_TOTAL",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "The expected reimbursement for physician transplant."
    },
    {
      "ordinalPosition": 6,
      "name": "COST_OUT_TAX_TOTAL",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "For inpatient claims sent to the Health Authority of Abu Dhabi that are paid by DRG, this item will hold the VAT amount calculated for the Cost Outlier Payment Total for use in claims printing. This item can be used in other, mutually exclusive scenarios for expected reimbursement calculations."
    },
    {
      "ordinalPosition": 7,
      "name": "ADD_ON_TAX_TOTAL",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "For inpatient claims sent to the Health Authority of Abu Dhabi that are paid by DRG, this item will hold the add-on VAT amount for the claim for use in claims printing. This item can be used in other, mutually exclusive scenarios for expected reimbursement calculations."
    },
    {
      "ordinalPosition": 8,
      "name": "SUPPLY_ADD_ON_PMT_TOTAL",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "For inpatient claims sent to the Dubai Health Authority that are paid by DRG, this item will hold the high cost supply add-on payment amount for the claim for use in claims printing. This item can be used in other, mutually exclusive scenarios for expected reimbursement calculations. The value and specific purpose for this item may change based on the extension used."
    },
    {
      "ordinalPosition": 9,
      "name": "DRUG_ADD_ON_PMT_TOTAL",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "For inpatient claims sent to the Dubai Health Authority that are paid by DRG, this item will hold the high cost drug add-on payment amount for the claim for use in claims printing. This item can be used in other, mutually exclusive scenarios for expected reimbursement calculations. The value and specific purpose for this item may change based on the extension used."
    }
  ]
}
