{
  "name": "HSP_BFH_PROF_TXS",
  "description": "Table contains Professional Billing payments that have been matched to a billing activity history record. Professional Billing self-pay payments are matched to billing activity history records only in service areas with Single Billing Office enabled.",
  "primaryKey": [
    {
      "columnName": "BFH_ID",
      "ordinalPosition": 1
    },
    {
      "columnName": "LINE",
      "ordinalPosition": 2
    }
  ],
  "columns": [
    {
      "ordinalPosition": 1,
      "name": "BFH_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "This column stores the unique identifier for the billing activity history record."
    },
    {
      "ordinalPosition": 2,
      "name": "LINE",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The line number for the information associated with this record. Multiple pieces of information can be associated with this record."
    },
    {
      "ordinalPosition": 3,
      "name": "PB_MATCHED_DATE",
      "type": "DATETIME",
      "discontinued": false,
      "description": "Date the Professional Billing payment was credited to the performed activity."
    },
    {
      "ordinalPosition": 4,
      "name": "PB_TX_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "This column stores the unique identifier for the Professional Billing transaction that this follow-up activity helped to generate."
    },
    {
      "ordinalPosition": 5,
      "name": "PB_MATCHED_AMOUNT",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "Self-pay amount from the Professional Billing transaction that this follow-up activity was credited with generating. Professional Billing self-pay payments are matched to billing activity records only in service areas with Single Billing Office enabled."
    },
    {
      "ordinalPosition": 6,
      "name": "PB_TX_MATCH_HX_LINE",
      "type": "INTEGER",
      "discontinued": false,
      "description": "Match line in the Professional Billing transaction matching history that is credited to this activity."
    },
    {
      "ordinalPosition": 7,
      "name": "PB_MATCHED_INSURANCE_AMOUNT",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "This column stores the insurance amount from the professional billing transactions that are credited to this activity."
    }
  ]
}
