{
  "name": "LIP_AND_ORAL_CAV_2",
  "description": "Stores single response data for College of American Pathologists (CAP) form 76029-LIP AND ORAL CAVITY: INCISIONAL BIOPSY, EXCISIONAL BIOPSY, RESECTION.",
  "primaryKey": [
    {
      "columnName": "RESULT_ID",
      "ordinalPosition": 1
    }
  ],
  "columns": [
    {
      "ordinalPosition": 1,
      "name": "RESULT_ID",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The unique identifier for the result record."
    },
    {
      "ordinalPosition": 2,
      "name": "MARGIN_IN_SITU_SPFY",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "CAP synoptic form item: Margins In Situ Specify Margins Per Orientation."
    },
    {
      "ordinalPosition": 3,
      "name": "SPECIAL_STUDY_TYPES",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "CAP synoptic form item: Special Studies - Specify Types."
    },
    {
      "ordinalPosition": 4,
      "name": "PT_FOR_MUC_MAL_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "CAP synoptic form item: Primary Tumor for Mucosal Malignant Melanoma.",
      "entries": [
        "pT3: Mucosal disease",
        "pT4a: Moderately advanced disease. Tumor involving deep soft tissue, cartilage, bone,",
        "pT4b: Very advanced disease. Tumor involving brain, dura, skull base, lower cranial n"
      ]
    },
    {
      "ordinalPosition": 5,
      "name": "REG_LYM_MUCOS_MEL_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "CAP synoptic form item: Regional Lymph Nodes (pN) for Mucosal Malignant Melanoma.",
      "entries": [
        "pNX: Cannot be assessed",
        "pN0: No regional lymph node metastasis",
        "pN1: Regional lymph node metastasis",
        "pN1: Metastasis in perirectal lymph nodes",
        "pN1: Metastasis in 1 to 3 regional lymph nodes",
        "pN1a: Metastasis in 1 regional lymph node",
        "pN1b: Metastasis in 2 to 3 regional lymph nodes",
        "pN1c: Tumor deposit(s) in the subserosa, or non-peritonealized pericolic or perirecta",
        "pN1 (IIIC1): Regional lymph node metastasis to pelvic lymph nodes",
        "pN1: Regional lymph node metastasis involving 1 to 2 nodes",
        "pN1 (IIIC): Regional lymph node metastasis",
        "pN1: Metastases to nodes along the cystic duct, common bile duct, hepatic artery",
        "pN1: Metastasis in single ipsilateral lymph node, 3 cm or less in greatest dimension",
        "pN1: Metastasis in ipsilateral peribronchial and / or ipsilateral hilar lymph nodes,",
        "pN1: Metastases in the ipsilateral bronchopulmonary or hilar lymph nodes",
        "pN1a: Clinically occult (microscopic) metastasis",
        "pN1b: Clinically apparent (macroscopic) metastasis",
        "pN1: Unilateral metastasis in lymph node(s), 6 cm or less in greatest dimension",
        "pN1: Metastasis in a single regional lymph node, 2 cm or less in greatest dimension",
        "pN1: Metastasis in 1 to 2 perigastric lymph nodes",
        "pN1: Metastasis with a lymph node mass less than 2 cm in greatest dimension,",
        "pN1a: Nodal metastases to Level VI lymph nodes",
        "pN1b: Metastases to unilateral, bilateral or contralateral cervical",
        "pN1: Single regional lymph node metastasis in the true pelvis",
        "pN1 (IVB): Pelvic or inguinal lymph node metastasis",
        "pN1: Metastasis in regional lymph node or nodes",
        "pN1: Regional lymph node involvement (preauricular, cervical, submandibular)",
        "pN2: Metastasis in unilateral internal iliac and / or inguinal lymph node(s)",
        "pN2: Metastasis in 4 or more regional lymph nodes",
        "pN2: Metastasis to periaortic/pericaval/super. mesentery artery/celiac artery lym nd",
        "pN2a: Metastasis in 4 to 6 regional lymph nodes",
        "pN2b: Metastasis in 7 or more regional lymph nodes",
        "pN2 (IIIC2): Regional lymph node metastasis to para-aortic lymph nodes, with or witho",
        "pN2: 3 to 6 nodes involved",
        "pN2: Metastases to periaortic,pericaval,super. mesenteric artery, celiac artery lym n",
        "pN2: Metastasis in a single ipsilateral lymph node, more than 3 cm",
        "pN2a: Metastasis in a single ipsilateral lymph node, more than 3 cm but not more than",
        "pN2b: Metastasis in a single ipsilateral lymph nodes, none >6cm in greatest dimension",
        "pN2b: Metastasis in multiple ipsilateral lymph nodes, none >6cm in greatest dimension",
        "pN2c: Metastasis in bilateral/contralateral lymph nodes, none >6cm in greatest dimen.",
        "pN2: Metastasis in ipsilateral mediastinal and / or subcarinal lymph node(s)",
        "pN2: Metastases in the subcarinal or the ipsilateral mediastinal lymph nodes",
        "pN2a: Clinically occult (microscopic) metastasis",
        "pN2b: Clinically apparent (macroscopic) metastasis",
        "pN2c: Satellite or in-transit metastasis without nodal metastasis",
        "pN2: Bilateral metastasis in lymph node(s), 6 cm or less in greatest dimension",
        "pN2: Metastasis in a single regional lymph node, more than 2 cm but not more than",
        "pN2: Metastasis in 3 to 6 perigastric lymph nodes",
        "pN2: Metastasis with a lymph node mass greater than 2 cm but not more than 5 cm",
        "pN2: Multiple regional lymph node metastasis in the true pelvis",
        "pN2: Distant lymph node involvement",
        "pN3: Metastasis in perirectal and inguinal lymph nodes and / or bilateral internal il",
        "pN3: 7 or more nodes involved",
        "pN3: Metastasis in a lymph node more than 6 cm in greatest dimension",
        "pN3: Metastasis in contralateral mediastinal, contralateral hilar, ipsilateral or",
        "pN3: Metastases in the contralateral mediastinal, contralateral internal mammary,",
        "pN3: Metastasis in 4 or more regional lymph nodes, or matted metastatic nodes, or",
        "pN3: Metastasis in a lymph node greater than 6 cm and / or to supraclavicular fossa",
        "pN3a: Greater than 6 cm in dimension",
        "pN3b: Extension to the supraclavicular fossa",
        "pN3: Metastasis in a regional lymph node more than 5 cm in greatest dimension",
        "pN3: Metastasis in 7 or more perigastric lymph nodes",
        "pN3a: Metastasis in 7 to 15 perigastric lymph nodes",
        "pN3b: Metastasis in 16 or more perigastric lymph nodes",
        "pN3: Metastasis with a lymph node mass greater than 5 cm in greatest dimension",
        "pN3: Lymph node metastasis to the common iliac lymph nodes",
        "pN1: One or two regional lymph nodes with the following features",
        "pN2 (FIGO IIIB): Regional lymph node metastasis with the following features",
        "pN3 (FIGO IVA): Fixed or ulcerated regional lymph node metastasis"
      ]
    },
    {
      "ordinalPosition": 6,
      "name": "MARGIN_SITU_CLOSE",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "CAP synoptic form item: Margins in Situ Distance of Carcinoma in Situ from Closest."
    }
  ]
}
