{
  "name": "LUNG_RESECTION",
  "description": "Stores single response data for College of American Pathologists (CAP) form 76030-Lung: Resection.",
  "primaryKey": [
    {
      "columnName": "RESULT_ID",
      "ordinalPosition": 1
    }
  ],
  "columns": [
    {
      "ordinalPosition": 1,
      "name": "RESULT_ID",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The unique identifier for the result record."
    },
    {
      "ordinalPosition": 2,
      "name": "TUMOR_SITE_SPECIFY",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "CAP synoptic form item: Specify tumor site."
    },
    {
      "ordinalPosition": 3,
      "name": "CAP_COMMENTS",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "CAP synoptic form item: General comments."
    },
    {
      "ordinalPosition": 4,
      "name": "SPEC_INTEGRITY_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "CAP synoptic form item: Specimen Integrity.",
      "entries": [
        "Intact",
        "Fragmented",
        "Single intact specimen (margins can be evaluated)",
        "Multiple designated specimens (e.g., main excision and identified margins)",
        "Fragmented (margins cannot be evaluated with certainty)",
        "Morcellated hysterectomy specimen",
        "Intact hysterectomy specimen",
        "Disrupted",
        "Indeterminate",
        "Other",
        "Not specified"
      ]
    },
    {
      "ordinalPosition": 5,
      "name": "SPEC_PROC_SPECIFY",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "CAP synoptic form item: Specify the Specimen Procedure."
    },
    {
      "ordinalPosition": 6,
      "name": "TUMOR_SIZE_GREAT",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "CAP synoptic form item: Tumor Greatest Size."
    },
    {
      "ordinalPosition": 7,
      "name": "TUMOR_SIZE_ADDL",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "CAP synoptic form item: Tumor Size (length)."
    },
    {
      "ordinalPosition": 8,
      "name": "TUMOR_SIZE_ADDL2",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "CAP synoptic form item: Tumor Size (width)."
    },
    {
      "ordinalPosition": 9,
      "name": "TUMOR_SIZE_SPECIFY",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "CAP synoptic form item: Specify Tumor Size."
    },
    {
      "ordinalPosition": 10,
      "name": "HISTO_TYPE_SPECIFY",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "CAP synoptic form item: Specify histologic type."
    },
    {
      "ordinalPosition": 11,
      "name": "ALL_MRG_UNIN_CAR_YN",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "CAP synoptic form item: All Margins Uninvolved By Invasive Carcinoma.",
      "entries": [
        "No",
        "Yes"
      ]
    },
    {
      "ordinalPosition": 12,
      "name": "CLOSEST_MRG_SPECIFY",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "CAP synoptic form item: Specify Closest Margin."
    },
    {
      "ordinalPosition": 13,
      "name": "TREATMENT_EFFECT_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "CAP synoptic form item: Treatment Effect.",
      "entries": [
        "Not identified",
        "No prior treatment",
        "Not applicable",
        "Present",
        "No definite response identified (grade 3, poor/no response; extensive residual tumor)",
        "No definite response identified (grade 3, poor or no response)",
        "Greater than 10% residual viable tumor",
        "Less than 10% residual viable tumor",
        "Greater than 50% residual viable tumor",
        "Less than 50% residual viable tumor",
        "No definite or minimal response identified (poor or no response)",
        "Marked response (minimal residual cancer)",
        "No known presurgical therapy",
        "No definite response to presurgical therapy",
        "Probable or definite response to presurgical therapy",
        "Cannot be determined",
        "Indeterminate",
        "Not known"
      ]
    },
    {
      "ordinalPosition": 14,
      "name": "VISC_PLEURA_INVAS_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "CAP synoptic form item: Visceral Pleura Invasion.",
      "entries": [
        "Cannot be assessed",
        "Not identified",
        "Absent",
        "Present",
        "Indeterminate",
        "Portal vein invasion present",
        "Hepatic vein invasion present",
        "Present within tumor nodules",
        "Present in vessels of parenchyma outside of tumor nodules",
        "Cannot be determined"
      ]
    },
    {
      "ordinalPosition": 15,
      "name": "SPECIAL_STD_SPFY",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "CAP synoptic form item: Specify Special Studies."
    },
    {
      "ordinalPosition": 16,
      "name": "EPIDRM_GRWTH_FACTOR",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "CAP synoptic form item: Specify Epidermal Growth Factor Receptor (EGFR) Analysis Results."
    },
    {
      "ordinalPosition": 17,
      "name": "LYM_ND_EXNDL_EXT_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "CAP synoptic form item: Lymph Nodes, Extranodal Extension."
    },
    {
      "ordinalPosition": 18,
      "name": "SPECIMEN_OTHER_SPFY",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "CAP synoptic form item: Specify other specimen."
    },
    {
      "ordinalPosition": 19,
      "name": "REG_LMPH_SITE_SPEC",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "CAP synoptic form item: Specify Regional Lymph Nodes Site."
    },
    {
      "ordinalPosition": 20,
      "name": "REGIONL_LYMPH_ND_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "CAP synoptic form item: Regional Lymph Nodes (pN).",
      "entries": [
        "pNX: Cannot be assessed",
        "pN0: No regional lymph node metastasis",
        "pN1: Regional lymph node metastasis",
        "pN1: Metastasis in perirectal lymph nodes",
        "pN1: Metastasis in 1 to 3 regional lymph nodes",
        "pN1a: Metastasis in 1 regional lymph node",
        "pN1b: Metastasis in 2 to 3 regional lymph nodes",
        "pN1c: Tumor deposit(s) in the subserosa, or non-peritonealized pericolic or perirecta",
        "pN1 (IIIC1): Regional lymph node metastasis to pelvic lymph nodes",
        "pN1: Regional lymph node metastasis involving 1 to 2 nodes",
        "pN1 (IIIC): Regional lymph node metastasis",
        "pN1: Metastases to nodes along the cystic duct, common bile duct, hepatic artery",
        "pN1: Metastasis in single ipsilateral lymph node, 3 cm or less in greatest dimension",
        "pN1: Metastasis in ipsilateral peribronchial and / or ipsilateral hilar lymph nodes,",
        "pN1: Metastases in the ipsilateral bronchopulmonary or hilar lymph nodes",
        "pN1a: Clinically occult (microscopic) metastasis",
        "pN1b: Clinically apparent (macroscopic) metastasis",
        "pN1: Unilateral metastasis in lymph node(s), 6 cm or less in greatest dimension",
        "pN1: Metastasis in a single regional lymph node, 2 cm or less in greatest dimension",
        "pN1: Metastasis in 1 to 2 perigastric lymph nodes",
        "pN1: Metastasis with a lymph node mass less than 2 cm in greatest dimension,",
        "pN1a: Nodal metastases to Level VI lymph nodes",
        "pN1b: Metastases to unilateral, bilateral or contralateral cervical",
        "pN1: Single regional lymph node metastasis in the true pelvis",
        "pN1 (IVB): Pelvic or inguinal lymph node metastasis",
        "pN1: Metastasis in regional lymph node or nodes",
        "pN1: Regional lymph node involvement (preauricular, cervical, submandibular)",
        "pN2: Metastasis in unilateral internal iliac and / or inguinal lymph node(s)",
        "pN2: Metastasis in 4 or more regional lymph nodes",
        "pN2: Metastasis to periaortic/pericaval/super. mesentery artery/celiac artery lym nd",
        "pN2a: Metastasis in 4 to 6 regional lymph nodes",
        "pN2b: Metastasis in 7 or more regional lymph nodes",
        "pN2 (IIIC2): Regional lymph node metastasis to para-aortic lymph nodes, with or witho",
        "pN2: 3 to 6 nodes involved",
        "pN2: Metastases to periaortic,pericaval,super. mesenteric artery, celiac artery lym n",
        "pN2: Metastasis in a single ipsilateral lymph node, more than 3 cm",
        "pN2a: Metastasis in a single ipsilateral lymph node, more than 3 cm but not more than",
        "pN2b: Metastasis in a single ipsilateral lymph nodes, none >6cm in greatest dimension",
        "pN2b: Metastasis in multiple ipsilateral lymph nodes, none >6cm in greatest dimension",
        "pN2c: Metastasis in bilateral/contralateral lymph nodes, none >6cm in greatest dimen.",
        "pN2: Metastasis in ipsilateral mediastinal and / or subcarinal lymph node(s)",
        "pN2: Metastases in the subcarinal or the ipsilateral mediastinal lymph nodes",
        "pN2a: Clinically occult (microscopic) metastasis",
        "pN2b: Clinically apparent (macroscopic) metastasis",
        "pN2c: Satellite or in-transit metastasis without nodal metastasis",
        "pN2: Bilateral metastasis in lymph node(s), 6 cm or less in greatest dimension",
        "pN2: Metastasis in a single regional lymph node, more than 2 cm but not more than",
        "pN2: Metastasis in 3 to 6 perigastric lymph nodes",
        "pN2: Metastasis with a lymph node mass greater than 2 cm but not more than 5 cm",
        "pN2: Multiple regional lymph node metastasis in the true pelvis",
        "pN2: Distant lymph node involvement",
        "pN3: Metastasis in perirectal and inguinal lymph nodes and / or bilateral internal il",
        "pN3: 7 or more nodes involved",
        "pN3: Metastasis in a lymph node more than 6 cm in greatest dimension",
        "pN3: Metastasis in contralateral mediastinal, contralateral hilar, ipsilateral or",
        "pN3: Metastases in the contralateral mediastinal, contralateral internal mammary,",
        "pN3: Metastasis in 4 or more regional lymph nodes, or matted metastatic nodes, or",
        "pN3: Metastasis in a lymph node greater than 6 cm and / or to supraclavicular fossa",
        "pN3a: Greater than 6 cm in dimension",
        "pN3b: Extension to the supraclavicular fossa",
        "pN3: Metastasis in a regional lymph node more than 5 cm in greatest dimension",
        "pN3: Metastasis in 7 or more perigastric lymph nodes",
        "pN3a: Metastasis in 7 to 15 perigastric lymph nodes",
        "pN3b: Metastasis in 16 or more perigastric lymph nodes",
        "pN3: Metastasis with a lymph node mass greater than 5 cm in greatest dimension",
        "pN3: Lymph node metastasis to the common iliac lymph nodes",
        "pN1: One or two regional lymph nodes with the following features",
        "pN2 (FIGO IIIB): Regional lymph node metastasis with the following features",
        "pN3 (FIGO IVA): Fixed or ulcerated regional lymph node metastasis"
      ]
    },
    {
      "ordinalPosition": 21,
      "name": "REG_LN_NUM_EXM",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "CAP synoptic form item: Regional Lymph Nodes Number Examined."
    },
    {
      "ordinalPosition": 22,
      "name": "REG_LN_NUM_INV",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "CAP synoptic form item: Regional Lymph Nodes Number Involved."
    },
    {
      "ordinalPosition": 23,
      "name": "PRIMARY_TUMOR_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "CAP synoptic form item: Primary Tumor (pT).",
      "entries": [
        "pTX: Cannot be determined",
        "pTX: Cannot be assessed, or tumor proven by presence of malignant cells in sputum or",
        "pTX: Cannot be assessed",
        "pT0: No evidence of primary tumor",
        "pTis: Carcinoma in situ",
        "pTis (DCIS): Ductal carcinoma in situ",
        "pTis (LCIS): Lobular carcinoma in situ",
        "pTis (Paget): Paget disease of the nipple NOT associated with invasive carcinoma and",
        "pTis: Carcinoma in situ, intraepithelial (no invasion)",
        "pTis: Carcinoma in situ, invasion of lamina propria",
        "pTis: High-grade dysplasia / carcinoma in situ",
        "pTis: Tubal intraepithelial carcinoma (limited to tubal mucosa)",
        "pTis: Melanoma in situ (i.e., not an invasive tumor: anatomic level I)",
        "Encapsulated",
        "Extracapsular extension without adjacent organ involvement",
        "Extension into adjacent organs",
        "Extension into spinal canal",
        "pTa: Papillary noninvasive carcinoma",
        "pTa: Noninvasive papillary carcinoma",
        "pTis: Intratubular germ cell neoplasia only (carcinoma in situ)",
        "pTis: Flat carcinoma in situ",
        "pTis: Carcinoma in situ: flat tumor",
        "Iris",
        "Ciliary Body and Choroid",
        "pT1: Tumor 5 cm or less in greatest dimension, no extra-adrenal invasion",
        "pT1: Tumor limited to ampulla of Vater or sphincter of Oddi",
        "pT1: Tumor 2 cm or less in greatest dimension",
        "pT1: Tumor invades submucosa",
        "pT1: Tumor confined to the bile duct histologically",
        "pT1: Solitary tumor without vascular invasion",
        "pT1: Tmr confined to bile duct, w/ extension up to muscle layer or fibrous tissue",
        "pT1: Tumor 8 cm or less in greatest dimension",
        "pT1mi: Tumor <= 1 mm in greatest dimension (microinvasion)",
        "pT1a: Tumor > 1 mm but <= 5 mm in greatest dimension",
        "pT1b: Tumor > 5 mm but <= 10 mm in greatest dimension",
        "pT1c: Tumor > 10 mm but <= 20 mm in greatest dimension",
        "pT1a (IA): Tumor limited to endometrium or invades less than one-half of myometrium",
        "pT1b (IB): Tumor invades greater than or equal to one-half of the myometrium",
        "pT1: Tumor invades lamina propria, muscularis mucosae, or submucosa",
        "pT1a: Tumor invades lamina propria or muscularis mucosae",
        "pT1a: Tumor invades lamina propria",
        "pT1 (I): Tumor limited to fallopian tube(s)",
        "pT1a (IA): Tumor limited to 1 tube without penetrating serosal surface; no ascites",
        "pT1b (IB): Tumor limited to both tubes w/o penetrating serosal surface; no ascites",
        "pT1c (IC): Tmr limited to 1 or both tube(s) w/ extension into or through tubal serosa",
        "pT1b: Tumor invades submucosa",
        "pT1b: Tumor invades muscle layer",
        "pT1: Tumor 7 cm or less in greatest dimension, limited to the kidney",
        "pT1a: Tumor 4 cm or less in greatest dimension, limited to the kidney",
        "pT1b: Tumor > 4cm but not more than 7cm in greatest dimension, limited to  kidney",
        "pT1a: Tumor 2 cm or less in greatest dimension, surrounded by lung or visceral pleura",
        "pT1b: Tumor greater than 2 cm, but 3 cm or less in greatest dimension, surrounded by",
        "pT1: Tumor <=2cm in greatest dimension (without extraparenchymal extension) (Note I)",
        "pT1a: Tumor limited to ipsilateral parietal pleura with or without mediastinal or",
        "pT1b: Tumor involves ipsilateral parietal pleura with or without mediastinal or",
        "pT1a: Melanoma 1.0 mm or less in thickness, no ulceration, <1 mitoses / mm*mm",
        "pT1b: Melanoma 1.0 mm or less in thickness with ulceration and/or 1+ mitoses/mm*mm",
        "pT1a (IA): Tumor limited to one ovary; capsule intact, no tumor on ovarian surface. N",
        "pT1b (IB): Tumor limited to both ovaries; capsule intact, no tumor on ovarian surface",
        "pT1c (IC): Tumor limited to one or both ovaries with any of the following: capsule",
        "pT1: Tumor limited to the pancreas, 2 cm or less in greatest dimension",
        "pN1: Metastasis in a single ipsilateral lymph node, 3 cm or less in greatest dimen",
        "pT1: Tumor confined to nasopharynx, or tumor extends to oropharynx and / or nasal",
        "pT1: Tmr limited to one subsite of hypopharynx and/or 2 cm or less in greatest dimen",
        "pT1: Tumor invades subepithelial connective tissue (lamina propria)",
        "pT1: Tumor confined to the eye with no optic nerve or choroidal invasion",
        "pT1a: Tumor 5 cm or less in greatest dimension, superficial tumor",
        "pT1b: Tumor 5 cm or less in greatest dimension, deep tumor",
        "pT1: Tumor 2 cm or less in greatest dimension with less than two high risk features",
        "pT1: Tumor limited to the testis and epididymis without vascular / lymphatic invasion",
        "pT1: Tumor size 2 cm or less, limited to thyroid",
        "pT1a: Tumor 1 cm or less in greatest dimension limited to the thyroid",
        "pT1b: Tmr more than 1 cm but not more than 2cm in greatest dimen., limited to thyroid",
        "pT1 (I): Tumor confined to uterus",
        "pT1a (IA): Invasive carcinoma diagnosed by microscopy only. All macroscopically",
        "pT1a1 (IA1): Stromal invasion 3.0mm or less in depth, horizontal spread 7.0mm or less",
        "pT1a2 (IA2): Stromal invasion more than 3.0 mm but not more than 5.0 mm in depth",
        "pT1b (IB): Clinically visible lesion confined to cervix/microscopic lesion > T1a2/IA2",
        "pT1b1 (IB1): Clinically visible lesion 4.0 cm or less in greatest dimension",
        "pT1b2 (IB2): Clinically visible lesion more than 4.0 cm in greatest dimension",
        "pT1 (I): Tumor confined to vaginal wall",
        "pT1a (FIGO IA): Lesions 2 cm or less in size, confined to the vulva or perineum",
        "pT1b (FIGO IB): Lesions more than 2 cm in size or any size with stromal invasion more",
        "pT2: Tumor greater than 5 cm, no extra-adrenal invasion",
        "pT2: Tumor invades duodenal wall",
        "pT2: Tumor more than 2 cm but not more than 5 cm in greatest dimension",
        "pT2: Tumor invades muscularis propria",
        "pT2: Tumor invades beyond the wall of the bile duct",
        "pT2a: Solitary tumor with vascular invasion",
        "pT2b: Multiple tumors, with or without vascular invasion",
        "pT2a: Tumor invades beyond the wall of the bile duct to surrounding adipose tissue",
        "pT2b: Tumor invades adjacent hepatic parenchyma",
        "pT2: Tumor more than 8 cm in greatest dimension",
        "pT2: Tumor > 20 mm but <= 50 mm in greatest dimension",
        "pT2 (II): Tumor invades stromal connective tissue of the cervix, but does not extend",
        "pT2 (II): Tumor involves 1 or both tube(s) with pelvic extension",
        "pT2a (IIA): Extension and / or metastasis to the uterus and / or ovaries",
        "pT2b (IIB): Extension to other pelvic structures",
        "pT2c (IIC): Pelvic extension (T2a,T2b/IIA or IIB) w/ malignant cells in ascites",
        "pT2: Tmr invades perimuscular connective tissue; no extension beyond serosa/in liver",
        "pT2: Solitary tumor with vascular invasion or multiple tumors none more than 5 cm",
        "pT2: Tumor more than 7 cm in greatest dimension, limited to the kidney",
        "pT2a: Tumor more than 7 cm but >= 10 cm in greatest dimension, limited to kidney",
        "pT2b: Tumor more than 10 cm, limited to the kidney",
        "pT2: Tumor more than 2 cm but not more than 4 cm in greatest dimension",
        "pT2a: Tumor greater than 3 cm, but 5 cm or less in greatest dimension surrounded by l",
        "pT2b: Tumor greater than 5 cm, but 7 cm or less in greatest dimension",
        "pT2: Tumor >2cm but <=4cm in greatest dimension (without extraparenchymal extension)",
        "pT2: Tumor involves each of the ipsilateral pleural surfaces (parietal, mediastinal,",
        "pT2a: Melanoma 1.01 to 2.0 mm in thickness, no ulceration",
        "pT2b: Melanoma 1.01 to 2.0 mm in thickness, with ulceration",
        "pT2a (IIA): Extension and / or implants on uterus and / or tube(s). No malignant cell",
        "pT2b (IIB): Extension to other pelvic tissues. No malignant cells in ascites or",
        "pT2c (IIC): Pelvic extension and/or implants (T2a or T2b / IIa or IIb) with malignant",
        "pT2: Tumor limited to the pancreas, more than 2 cm in greatest dimension",
        "pN2: Metastasis in a single ipsilateral lymph node, more than 3 cm but not more than",
        "pT2: Tumor with parapharyngeal extension",
        "pT2: Tumor invades more than one subsite of hypopharynx or an adjacent site, or",
        "pT2: Organ confined",
        "pT2a: Unilateral, involving one-half of 1 side or less",
        "pT2b: Unilateral, involving more than one-half of 1 side but not both sides",
        "pT2c: Bilateral disease",
        "pT2a: Tmr invades optic nerve head no extend past lamina or focal choroidal invasion",
        "pT2b: Tmr invades optic nerve head no extend past lamina and focal choroidal invasion",
        "pT2a: Tumor more than 5 cm in greatest dimension, superficial tumor",
        "pT2b: Tumor more than 5 cm in greatest dimension, deep tumor",
        "pT2: Tumor greater than 2 cm in greatest dimension with or without one additional",
        "pT2: Tumor limited to the testis and epididymis with vascular / lymphatic invasion",
        "pT2: Tumor more than 2 cm, but not more than 4 cm, limited to thyroid",
        "pT2 (II): Tumor extends outside of the uterus but is limited to genital structures",
        "pT2a: Tumor invades superficial muscularis propria (inner half)",
        "pT2b: Tumor invades deep muscularis propria (outer half)",
        "pT2a (IIA): Tumor without parametrial invasion",
        "pT2a1 (IIA1): Clinically visible lesion less than or equal to 4.0cm in greatest dimen",
        "pT2a2 (IIA2): Clinically visible lesion greater than 4.0 cm in greatest dimension",
        "pT2b (IIB): Tumor with parametrial invasion",
        "pT2 (II): Tumor invades paravaginal tissues but not the pelvic wall",
        "pT2 (FIGO II): Tumor of any size with extension to adjacent perineal structures",
        "pT3: Tumor of any size with local invasion, but not invading adjacent organs",
        "pT3: Tumor invades pancreas",
        "pT3: Tumor more than 5 cm in greatest dimension",
        "pT3: Tumor invades through the muscularis propria into the subserosa or mesoappendix",
        "pT3: Tmr invades gallbladder,pancreas,duodenum,other adj. organs w/o involvement of",
        "pT3: Tmr perforates visc. peritoneum/invol local extrahepatic struct. by direct invas",
        "pT3: Tumor invades unilateral branches of the portal vein or hepatic artery",
        "pT3: Discontinuous tumors in primary bone site (not including skip metastases)",
        "pT3: Tumor > 50 mm in greatest dimension",
        "pT3: Tumor invades through the muscularis propria into pericolorectal tissues",
        "pT3a (IIIA): Tumor involves serosa and / or adnexa (direct extension or metastasis)",
        "pT3b (IIIB): Vaginal involvement (direct extension/metastasis) or parametrial involve",
        "pT3: Tumor invades adventitia",
        "pT3/N1 (III): Tmr involves 1 or both tube(s) with peritoneal implants outside pelvis",
        "pT3a (IIIA): Microscopic peritoneal metastasis beyond pelvis",
        "pT3b (IIIB): Macroscopic peritoneal metastasis beyond pelvis <=2cm in greatest dimen",
        "pT3c / NI (IIIC): Peritoneal metastasis beyond pelvis >2cm in greatest dimen",
        "pT3: Tumor perforates serosa (visceral peritoneum) and/or directly invades the liver",
        "pT3a: Multiple tumors more than 5 cm",
        "pT3b: Single/multiple tmrs any size involving major branch of portal/hepatic veins",
        "pT3: Tmr extends into major veins/perinephric tissues, not into ipsilateral adrenal",
        "pT3a: Tumor grossly extends into the renal vein or its segmental (muscle containing)",
        "pT3b: Tumor grossly extends into the vena cava below the diaphragm",
        "pT3c: Tmr grossly extends into vena cava above diaphragm or invades wall of vena cava",
        "pT3: Mucosal disease",
        "pT3: Tumor more than 4 cm in greatest dimension",
        "pT3: Tumor greater than 7 cm in greatest dimension; or Tumor of any size that",
        "pT3: Tumor more than 4 cm and / or tumor (having extraparenchymal extension) (Note I)",
        "pT3: Locally advanced but potentially resectable tumor that involves all of the",
        "pT3a: Melanoma 2.01 to 4.0 mm in thickness, no ulceration",
        "pT3b: Melanoma 2.01 to 4.0 mm in thickness, with ulceration",
        "pT3a (IIIA): Microscopic peritoneal metastasis beyond pelvis (no macroscopic tumor)",
        "pT3b (IIIB): Macroscopic peritoneal metastasis beyond pelvis <=2 cm in greatest dimen",
        "pT3c and / or N1 (IIIC): Peritoneal metastasis beyond pelvis >2 cm in greatest dimen",
        "pT3: Tumor extends beyond the pancreas but without involvement of the celiac axis or",
        "pT3: Tmr >4 cm in greatest dimension/extension to lingual surface of epiglottis",
        "pT3: Tumor invades bony structures of skull base and / or paranasal sinuses",
        "pT3: Tumor measures more than 4 cm in greatest dimension or with fixation of hemilary",
        "pT3a: Extraprostatic extension or microscopic invasion of bladder neck",
        "pT3b: Seminal vesicle invasion",
        "pT3: Tumor invades beyond muscularis into peripelvic fat or the renal parenchyma",
        "pT3a: Tumor invades optic nerve past lamina cribrosa OR focal choroidal invasion",
        "pT3b: Tumor invades optic nerve past lamina cribrosa AND focal choroidal invasion",
        "pT3: Tumor invades through the muscularis propria into the subserosa or into the",
        "pT3: Tumor with invasion of maxilla, mandible, orbit, or temporal bone",
        "pT3: Tumor invades subserosal connective tissue, without involvement of",
        "pT3: Tumor invades spermatic cord with or without vascular / lymphatic invasion",
        "pT3: Tumor >4 cm limited to thyroid or any tumor with minimal extrathyroid extension",
        "pT3: Tumor invades beyond muscularis propria into periureteric fat",
        "pT3a: Microscopically",
        "pT3b: Macroscopically (extravesicular mass)",
        "pT3a (IIIA): Tumor involves lower third of vagina, but not pelvic wall",
        "pT3b (IIIB): Tmr extend to pelvic wall and/or causes hydronephrosis/non-funct. kidney",
        "pT3 (III): Tumor extends to pelvic wall",
        "pT3 (FIGO IVA): Tumor of any size with extension to any of the following",
        "pT4: Tumor of any size with invasion of adjacent organs",
        "pT4: Tumor invades peripancreatic soft tissues or other adjacent organs or structures",
        "pT4: Tmr of any size w/ invasion of adjacent organ(s) e.g. vagina, urethra, bladder",
        "pT4: Tumor penetrates visceral peritoneum, including mucinous peritoneal tumor within",
        "pT4: Tumor involves the celiac axis or the superior mesenteric artery",
        "pT4: Tumor with periductal invasion",
        "pT4: Tumor invades main portal vein or its branches bilaterally; or the common hepati",
        "pT4 (IVA): Tumor invades bladder mucosa and/or bowel mucosa",
        "pT4: Tumor invades adjacent structures",
        "pT4: Tumor invades main portal vein or hepatic artery or invades 2+ extrahepatic",
        "pT4: Tmr w/ direct invasion of adj. organs other than gallbladder",
        "pT4: Tmr invades beyond Gerota�s fascia",
        "pT4: Tumor of any size that invades any of the following: mediastinum, heart, great",
        "pT4: Locally advanced technically unresectable tumor involving all of the ipsilateral",
        "pT4: Tumor with intracranial extension and / or involvement of cranial nerves,",
        "pT4: Invasion of rectum, levator muscles, and / or pelvic wall (Note J)",
        "pT4: Tumor invades adjacent organs, or through the kidney into the perinephric fat",
        "pT4a: Tmr invades optic nerve to resection line, no extra-ocular extension identified",
        "pT4b: Tumor invades optic nerve to resection line, extra-ocular extension identified",
        "pT4: Tumor with direct or perineural invasion of skull base or axial skeleton",
        "pT4: Tmr involves visc. peritoneum (serosal surf.) or directly invades adj. structure",
        "pT4: Tumor invades scrotum with or without vascular / lymphatic invasion",
        "pT4: Tumor invades adjacent organs",
        "pT4 (IVA): Tmr invades the mucosa of bladder/rectum and/or extends beyond true pelvis",
        "pT4 (IVA): Tmr invades mucosa of bladder or rectum and/or extends beyond true pelvis",
        "pT4a: Tumor penetrates visceral peritoneum, including mucinous peritoneal tumor withi",
        "pT4a: Tumor penetrates the visceral peritoneum",
        "pT4a: Extension to chest wall, not including only pectoralis muscle adherence / invas",
        "pT4b: Ulceration/ipsilateral satellite nodules/edema of skin which dont meet criteria",
        "pT4c: Both T4a and T4b",
        "pT4d: Inflammatory carcinoma",
        "pT4b: Tumor directly invades other organs or structures",
        "pT4b: Tumor directly invades or is adherent to other organs or structures",
        "pT4a: Resectable tumor invading pleura, pericardium, or diaphragm",
        "pT4b: Unresectable tmr invading other adj. structures, such as aorta, vertebral body",
        "Any T / Any N and M1 (IV): Distant metastasis including presence of malignant cells",
        "Primary Tumor (pT): Supraglottis",
        "Primary Tumor (pT): Glottis",
        "Primary Tumor (pT): Subglottis",
        "pT4a: Moderately advanced disease. Tumor involving deep soft tissue, cartilage, bone,",
        "pT4b: Very advanced disease. Tumor involving brain, dura, skull base,",
        "pT4a: Moderately advanced local disease.",
        "pT4b: Very advanced local disease.",
        "pT4a: Moderately advanced local disease. Tumor invades skin, mandible, ear canal,",
        "pT4b: Very advanced local disease. Tumor invades skull base and / or pterygoid plates",
        "pT4a: Melanoma greater than 4.0 mm in thickness, no ulceration",
        "pT4b: Melanoma greater than 4.0 mm in thickness, with ulceration",
        "Primary Tumor (pT): Maxillary Sinus",
        "Primary Tumor (pT): Nasal Cavity and Ethmoid Sinus",
        "pT4a: Moderately advanced local disease. Tumor invades larynx, deep / extrinsic",
        "pT4b: Very advanced local disease. Tumor invades lateral pterygoid muscle, pterygoid",
        "pT4a: Moderately advanced local disease. Tumor invades thyroid / cricoid cartilage,",
        "pT4b: Very advanced local disease. Tumor invades prevertebral fascia, encases",
        "pT4a: Tumor involves visceral peritoneum (serosal surface)",
        "pT4b: Tumor directly invades adjacent structures",
        "pT4a: Moderately advanced disease. Tumor of any size extending beyond the thyroid",
        "pT4b: Very advanced disease. Tumor invades prevertebral fascia or encases carotid",
        "pT4a: Intrathyroidal anaplastic carcinoma-surgically resectable",
        "pT4b: Extrathyroidal anaplastic carcinoma-surgically unresectable",
        "pT4a: Tumor invades prostatic stroma or uterus or vagina",
        "pT4b: Tumor invades pelvic wall or abdominal wall",
        "Not identified"
      ]
    },
    {
      "ordinalPosition": 24,
      "name": "DISTNT_METASTASIS_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "CAP synoptic form item: Distant Metastasis.",
      "entries": [
        "Not applicable",
        "cM0 (i+): No clinical or radiographic evidence of distant metastasis",
        "pM0: No distant metastasis",
        "pM1: Distant metastasis",
        "pM1a: Intraperitoneal metastasis beyond the right lower quadrant, including pseudomyx",
        "pM1b: Nonperitoneal metastasis",
        "pM1: Distant detectable metastasis as determined by classic clinical",
        "pM1 (IVB): Distant metastasis",
        "pM1a: Separate tumor nodule(s) in contralateral lung; tumor with pleural nodules or",
        "pM1b: Distant metastases outside the lung / pleura",
        "pM1: Distant metastasis (documented in this specimen)",
        "pM1a: Metastasis in skin, subcutaneous tissues, or distant lymph nodes",
        "pM1b: Metastasis to lung",
        "pM1c: Metastasis to all other visceral sites or distant metastasis at any site",
        "pM1a: Nonregional lymph node(s)",
        "pM1b: Bone(s)",
        "pM1c: Other site(s) with or without bone disease",
        "pM1: Metastasis to sites other than CNS",
        "pM1a: Single lesion",
        "pM1b: Multiple lesions",
        "pM1c: CNS metastasis",
        "pM1d: Discrete mass(es) without leptomeningeal and / or CSF involvement",
        "pM1e: Leptomeningeal and / or CSF involvement",
        "pM1a: Non-regional lymph nodes or pulmonary metastasis",
        "pM1b: Distant metastasis other than to nonregional lymph nodes and lungs",
        "pM1a (III): Tumor extends to the lungs with or without genital tract involvement",
        "pM1b (IV): Tumor involves other metastatic sites",
        "pM1a: Largest diameter of the largest metastasis 3 cm or less",
        "pM1b: Largest diameter of the largest metastasis 3.1-8.0 cm",
        "pM1c: Largest diameter of the largest metastasis 8 cm or more",
        "pM1a: Lung",
        "pM1b: Metastasis involving distant sites other than lung (including skip metastases)",
        "Distant Metastasis present (includes metastasis to lymph nodes)"
      ]
    },
    {
      "ordinalPosition": 25,
      "name": "DSTNT_METASTATIS_ST",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "CAP synoptic form item: Distant Metastatis Sites."
    },
    {
      "ordinalPosition": 26,
      "name": "ADDL_PATH_FIND_SPFY",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "CAP synoptic form item: Specify additional pathologic findings."
    },
    {
      "ordinalPosition": 27,
      "name": "HISTOLOGIC_GRADE_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "CAP synoptic form item: Histologic Grade.",
      "entries": [
        "Not applicable",
        "GX: Cannot be assessed",
        "G1: Well differentiated",
        "G2: Moderately differentiated",
        "G3: Poorly differentiated",
        "G4: Undifferentiated",
        "G4: Undifferentiated / anaplastic",
        "WHO grade not assigned",
        "Low-grade (well-differentiated to moderately differentiated)",
        "High-grade (poorly differentiated to undifferentiated)",
        "FIGO Grade 1",
        "FIGO Grade 2",
        "FIGO Grade 3",
        "Favorable (purely epithelial, fetal subtype, mitotically inactive with <=2 mitoses in",
        "Less favorable (all subtypes other than those designated \"Favorable\" or \"Unfavorable\"",
        "Unfavorable (small cell undifferentiated or rhabdoid as the predominant or sole histo",
        "Gleason Pattern",
        "Ungraded sarcoma",
        "pGX: Grade cannot be assessed",
        "pG1: Spindle cell melanoma",
        "pG2: Mixed cell melanoma",
        "pG3: Epithelioid cell melanoma",
        "WHO Grade I",
        "WHO Grade II",
        "WHO Grade III",
        "WHO Grade IV",
        "pG1: Well differentiated",
        "pG2: Moderately differentiated",
        "pG3: Poorly differentiated",
        "pG4: Undifferentiated",
        "FNCLCC Grade 1",
        "FNCLCC Grade 2",
        "FNCLCC Grade 3",
        "Grade 1",
        "Grade 2",
        "Grade 3",
        "Cannot be determined",
        "Other"
      ]
    },
    {
      "ordinalPosition": 28,
      "name": "HISTOLGC_GRADE_SPFY",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "CAP synoptic form item: Specify histologic grade."
    },
    {
      "ordinalPosition": 29,
      "name": "TUM_FOC_SEP_SPFY",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "CAP synoptic form item: Tumor Focality - Specify Separate Tumor Nodules in Different Lobes."
    },
    {
      "ordinalPosition": 30,
      "name": "TUM_FOC_SYNC_SPFY",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "CAP synoptic form item: Tumor Focality - Specify Synchronous carcinomas."
    },
    {
      "ordinalPosition": 31,
      "name": "INV_CARC_CLOSE_MRG",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "CAP synoptic form item: Invasive Carcinoma Distance from Closest Margin."
    },
    {
      "ordinalPosition": 32,
      "name": "KRAS_MUT_ANLYS_SPFY",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "CAP synoptic form item: Specify KRAS Mutational Analysis."
    },
    {
      "ordinalPosition": 33,
      "name": "TMR_EXTENSION_SPFY",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "CAP synoptic form item: Specify Tumor Extension."
    },
    {
      "ordinalPosition": 34,
      "name": "PARENCHYMAL_MRG_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "CAP synoptic form item: Parenchymal margin.",
      "entries": [
        "Cannot be assessed",
        "Margin uninvolved by invasive carcinoma",
        "Margin involved by invasive carcinoma",
        "Not applicable"
      ]
    },
    {
      "ordinalPosition": 35,
      "name": "INFLAMMATION_SPFY",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "CAP synoptic form item: Specify Inflammation."
    },
    {
      "ordinalPosition": 36,
      "name": "HST_TYP_OTHR_NONSML",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "CAP synoptic form item: Histologic Type - Specify type of other non-small cell carcinoma component."
    },
    {
      "ordinalPosition": 37,
      "name": "CHEST_WALL_STRUCT",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "CAP synoptic form item: Tumor Extension - Specify Chest Wall Involved Structures."
    },
    {
      "ordinalPosition": 38,
      "name": "MEDIAST_INV_STRUCT",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "CAP synoptic form item: Tumor Extension - Specify Mediastinum Involved Structures."
    },
    {
      "ordinalPosition": 39,
      "name": "BRON_MRG_INV_CARC_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "CAP synoptic form item: Bronchial Margin Involvement by Invasive Carcinoma.",
      "entries": [
        "Not applicable",
        "Cannot be assessed",
        "Unvolved by invasive carcinoma",
        "Involved by invasive carcinoma"
      ]
    },
    {
      "ordinalPosition": 40,
      "name": "BRON_MRG_SQM_CIS_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "CAP synoptic form item: Bronchial Margin Involvement by Squamous Cell Carcinoma in situ (CIS).",
      "entries": [
        "Not applicable",
        "Cannot be assessed",
        "Squamous cell carcinoma in situ present at bronchial margin",
        "Squamous cell carcinoma in situ (CIS) not identified at bronchial margin"
      ]
    },
    {
      "ordinalPosition": 41,
      "name": "VASCULAR_MARGIN_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "CAP synoptic form item: Vascular Margin."
    },
    {
      "ordinalPosition": 42,
      "name": "PARIETL_PLEUR_MRG_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "CAP synoptic form item: Parietal Pleural Margin."
    },
    {
      "ordinalPosition": 43,
      "name": "CHEST_WALL_MRG_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "CAP synoptic form item: Chest Wall Margin."
    },
    {
      "ordinalPosition": 44,
      "name": "OTHR_ATT_TISS_MRG_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "CAP synoptic form item: Other Attached Tissue Margin.",
      "entries": [
        "Not applicable",
        "Specify tissue margin"
      ]
    },
    {
      "ordinalPosition": 45,
      "name": "OTHR_ATT_TISS_SPFY",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "CAP synoptic form item: Specify Other Attached Tissue Margin."
    },
    {
      "ordinalPosition": 46,
      "name": "OTHR_ATT_TISS_ASM_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "CAP synoptic form item: Other Attached Tissue Margin Assessment."
    },
    {
      "ordinalPosition": 47,
      "name": "TMR_ASSC_ATELECTS_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "CAP synoptic form item: Tumor Associated Atelectasis or Obstructive Pneumonitis.",
      "entries": [
        "Extends to the hilar region but does not involve entire lung",
        "Involves entire lung"
      ]
    },
    {
      "ordinalPosition": 48,
      "name": "ADDL_PATH_METAPLASI",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "CAP synoptic form item: Additional Pathologic Findings - Specify Metaplasia."
    },
    {
      "ordinalPosition": 49,
      "name": "SPEC_LOBE_SPCFY",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "CAP synoptic form item: Specimen - Specify Lobes of Lung."
    },
    {
      "ordinalPosition": 50,
      "name": "SPEC_BRONC_SPFY",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "CAP synoptic form item: Specimen - Specify Bronchus."
    },
    {
      "ordinalPosition": 51,
      "name": "REG_LMPH_NUM_CBT_YN",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "CAP synoptic form item: Regional Lymph Nodes Number Cannot be Determined."
    },
    {
      "ordinalPosition": 52,
      "name": "HST_TYP_NONSML_CARC",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "CAP synoptic form item: Histologic Type - Specify type of non-small cell carcinoma component."
    }
  ]
}
