{
  "name": "OCCURRENCE_CODES",
  "description": "The EPISODE table contains high-level information on the episodes recorded in clinical system for your patients. When a provider sees a patient several times for an ongoing condition, such as prenatal care, these encounters can be linked to a single Episode of Care.",
  "primaryKey": [
    {
      "columnName": "SUMMARY_BLOCK_ID",
      "ordinalPosition": 1
    }
  ],
  "columns": [
    {
      "ordinalPosition": 1,
      "name": "SUMMARY_BLOCK_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "The unique identifier for the summary block record."
    },
    {
      "ordinalPosition": 2,
      "name": "REHAB_ONSET_DATE",
      "type": "DATETIME",
      "discontinued": false,
      "description": "The date of onset of the symptoms being treated in the rehabilitation episode. This corresponds with occurrence code 11 on the claim."
    },
    {
      "ordinalPosition": 3,
      "name": "PT_CAREPLAN_DATE",
      "type": "DATETIME",
      "discontinued": false,
      "description": "The date the physical therapy (PT) care plan was established or last updated. This corresponds with occurrence code 29 on the claim."
    },
    {
      "ordinalPosition": 4,
      "name": "OT_CAREPLAN_DATE",
      "type": "DATETIME",
      "discontinued": false,
      "description": "The date the occupational therapy (OT) care plan was established or last updated. This corresponds with occurrence code 17 on the claim."
    },
    {
      "ordinalPosition": 5,
      "name": "SLP_CAREPLAN_DATE",
      "type": "DATETIME",
      "discontinued": false,
      "description": "The date the speech-language pathology (SLP) care plan was established or last updated. This corresponds with occurrence code 30 on the claim."
    },
    {
      "ordinalPosition": 6,
      "name": "PT_TREATMENT_DATE",
      "type": "DATETIME",
      "discontinued": false,
      "description": "The date physical therapy (PT) treatment started. This corresponds with occurrence code 35 on the claim."
    },
    {
      "ordinalPosition": 7,
      "name": "OT_TREATMENT_DATE",
      "type": "DATETIME",
      "discontinued": false,
      "description": "The date occupational therapy (OT) treatment started. This corresponds with occurrence code 44 on the claim."
    },
    {
      "ordinalPosition": 8,
      "name": "SLP_TREATMENT_DATE",
      "type": "DATETIME",
      "discontinued": false,
      "description": "The date speech-language pathology (SLP) treatment started. This corresponds with occurrence code 45 on the claim."
    }
  ]
}
