{
  "name": "OFFLINE_DOC_COL_DTTM",
  "description": "This table extracts the Flowsheet Column Time documented in offline mode, which triggered an offline check.",
  "primaryKey": [
    {
      "columnName": "PAT_ENC_CSN_ID",
      "ordinalPosition": 1
    },
    {
      "columnName": "GROUP_LINE",
      "ordinalPosition": 2
    },
    {
      "columnName": "VALUE_LINE",
      "ordinalPosition": 3
    }
  ],
  "columns": [
    {
      "ordinalPosition": 1,
      "name": "PAT_ENC_CSN_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "The unique contact serial number for this contact. This number is unique across all patient encounters in your system. If you use IntraConnect, this is the Unique Contact Identifier (UCI)."
    },
    {
      "ordinalPosition": 2,
      "name": "GROUP_LINE",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The line number of the Offline Documentation Check in the patient's record. Together with PAT_ENC_CSN_ID, this forms the foreign key to the OFFLINE_DOC_COL_NM table."
    },
    {
      "ordinalPosition": 3,
      "name": "VALUE_LINE",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The line number of one of the multiple Offline Documentation Checks that are associated with the patient and the encounter from the OFFLINE_DOC_COL_DTTM table."
    },
    {
      "ordinalPosition": 4,
      "name": "PAT_ENC_DATE_REAL",
      "type": "FLOAT",
      "discontinued": false,
      "description": "A unique contact date in decimal format. The integer portion of the number indicates the date of contact. The digits after the decimal distinguish different contacts on the same date and are unique for each contact on that date. For example, .00 is the first/only contact, .01 is the second contact, etc."
    },
    {
      "ordinalPosition": 5,
      "name": "CONTACT_DATE",
      "type": "DATETIME",
      "discontinued": false,
      "description": "The date of this contact in calendar format."
    },
    {
      "ordinalPosition": 6,
      "name": "CM_CT_OWNER_ID",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The Community ID (CID) of the instance that owns this contact. This is only populated if you use IntraConnect."
    },
    {
      "ordinalPosition": 7,
      "name": "OFFLINE_FLWSHT_RECORDED_DTTM",
      "type": "DATETIME (Local) ",
      "discontinued": false,
      "description": "Flowsheet column time that the offline documentation check applies to. It is possible that this column has null values if the offline documentation check does not have a Flowsheets time column associated with it such as BPAs."
    }
  ]
}
