{
  "name": "ORD_RESEARCH_CODE",
  "description": "This table contains information about research studies that an order is associated with. The table includes a column that links to the corresponding Research Study (RSH) record.",
  "primaryKey": [
    {
      "columnName": "ORDER_ID",
      "ordinalPosition": 1
    },
    {
      "columnName": "LINE",
      "ordinalPosition": 2
    }
  ],
  "columns": [
    {
      "ordinalPosition": 1,
      "name": "ORDER_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "The unique identifier for the order record."
    },
    {
      "ordinalPosition": 2,
      "name": "LINE",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The line number for the information associated with this record. Multiple pieces of information can be associated with this record."
    },
    {
      "ordinalPosition": 3,
      "name": "RESEARCH_CODE_ID",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The ID number of the Research Study record that is associated with the Order.  A research study record stores information about a research study. If an Order record is linked to one, it means that the Order is somehow related to the research study."
    },
    {
      "ordinalPosition": 4,
      "name": "RSH_CODE_COMMENT",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Any comments associated with a linked Research Study record. A Research Study record stores information about research studies.  This column is used in combination with the RESEARCH_CODE_ID column and stores any comments a user may have made regarding the link between the Order and the research study."
    },
    {
      "ordinalPosition": 5,
      "name": "RSH_CODE_FROM_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "This item stores where the research association in Research Study record ID came from. This is so that we can track where an association was made, to avoid potentially overwriting data from one valid source with another, such as overwriting Research Association Grid data with Order-Specific question data.",
      "entries": [
        "Research Association Grid",
        "Order-Specific Question Response",
        "Treatment Plan",
        "Interfaced",
        "Reflex API",
        "SmartSet",
        "DBC Association Popup"
      ]
    },
    {
      "ordinalPosition": 6,
      "name": "ENROLL_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "The unique ID of the research study association that has been linked to this order. Linking an order to a research study association means the order is related to the execution of the research study."
    }
  ]
}
