{
  "name": "PAT_ENC_EM_CODE_DX",
  "description": "The PAT_ENC_EM_CODE_DX table enables you to report on the diagnoses associated with evaluation and management (E/M) codes entered for a patient encounter. Since one E/M code may be associated with multiple diagnoses, each row in this table is one E/M code - diagnosis relation. This table contains only information for those E/M codes and diagnoses that have been explicitly associated.",
  "primaryKey": [
    {
      "columnName": "PAT_ENC_CSN_ID",
      "ordinalPosition": 1
    },
    {
      "columnName": "LINE",
      "ordinalPosition": 2
    }
  ],
  "columns": [
    {
      "ordinalPosition": 1,
      "name": "PAT_ENC_CSN_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "The unique contact serial number for this contact. This number is unique across all patient encounters in your system. If you use IntraConnect, this is the Unique Contact Identifier (UCI)."
    },
    {
      "ordinalPosition": 2,
      "name": "LINE",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The line number for the information associated with this contact. Multiple pieces of information can be associated with this contact."
    },
    {
      "ordinalPosition": 3,
      "name": "PAT_ENC_DATE_REAL",
      "type": "FLOAT",
      "discontinued": false,
      "description": "A unique contact date in decimal format. The integer portion of the number indicates the date of contact. The digits after the decimal distinguish different contacts on the same date and are unique for each contact on that date. For example, .00 is the first/only contact, .01 is the second contact, etc."
    },
    {
      "ordinalPosition": 4,
      "name": "CONTACT_DATE",
      "type": "DATETIME",
      "discontinued": false,
      "description": "The date of this contact in calendar format."
    },
    {
      "ordinalPosition": 5,
      "name": "EM_CODE_LINE",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The indicator of the E/M code associated with the diagnosis. This value corresponds to the LINE column in the ADDITIONAL_EM_CODE table. Together with PAT_ENC_CSN_ID, this forms the foreign key to the ADDITIONAL_EM_CODE table."
    },
    {
      "ordinalPosition": 6,
      "name": "DX_UNIQUE",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The unique identifier of the diagnosis associated with the Evaluation and Management (E/M) code. This value corresponds to the DX_UNIQUE column in the PAT_ENC_DX table. Together with PAT_ENC_CSN_ID, this forms the foreign key to the PAT_ENC_DX table."
    }
  ]
}
