{
  "name": "PAT_ENC_CHART_REV",
  "description": "This table contains information about who reviewed a patient chart and the instant that they reviewed it. The patient chart is synonymous with a patient encounter or contact in this table. With appropriate setup the patient chart can be reviewed from In Basket and a chart/encounter can be reviewed more than once and by more than one person. Each instance and person that reviews a chart will be stored in this table.",
  "primaryKey": [
    {
      "columnName": "PAT_ENC_CSN_ID",
      "ordinalPosition": 1
    },
    {
      "columnName": "LINE",
      "ordinalPosition": 2
    }
  ],
  "columns": [
    {
      "ordinalPosition": 1,
      "name": "PAT_ENC_CSN_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "The unique contact serial number for this contact. This number is unique across all patient encounters in your system. If you use IntraConnect this is the Unique Contact Identifier (UCI)."
    },
    {
      "ordinalPosition": 2,
      "name": "LINE",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The line number for the information associated with this contact. Multiple pieces of information can be associated with this contact."
    },
    {
      "ordinalPosition": 3,
      "name": "PAT_ENC_DATE_REAL",
      "type": "FLOAT",
      "discontinued": false,
      "description": "A unique contact date in decimal format. The integer portion of the number indicates the date of contact. The digits after the decimal distinguish different contacts on the same date and are unique for each contact on that date. For example, .00 is the first/only contact, .01 is the second contact, etc."
    },
    {
      "ordinalPosition": 4,
      "name": "CONTACT_DATE",
      "type": "DATETIME",
      "discontinued": false,
      "description": "The date of this contact in calendar format."
    },
    {
      "ordinalPosition": 5,
      "name": "CHRT_REV_BY_USER_ID",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The unique ID associated with the user record for this row. This column is frequently used to link to the CLARITY_EMP table.",
      "linksTo": "CLARITY_EMP"
    },
    {
      "ordinalPosition": 6,
      "name": "CHRT_REV_BY_USER_ID_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The name of the user record. This name may be hidden."
    },
    {
      "ordinalPosition": 7,
      "name": "CHRT_REV_ON_DTTM",
      "type": "DATETIME (Local) ",
      "discontinued": false,
      "description": "The instant when the patient chart was reviewed."
    }
  ]
}
