{
  "name": "PATIENT_SA_ACCESS",
  "description": "This table  keeps track of the events (ADT, Cadence, Referral) that can update patient's service area.",
  "primaryKey": [
    {
      "columnName": "PAT_ENC_CSN_ID",
      "ordinalPosition": 1
    },
    {
      "columnName": "LINE",
      "ordinalPosition": 2
    }
  ],
  "columns": [
    {
      "ordinalPosition": 1,
      "name": "PAT_ENC_CSN_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "The unique contact serial number for this contact. This number is unique across all patient encounters in your system. If you use IntraConnect this is the Unique Contact Identifier (UCI)."
    },
    {
      "ordinalPosition": 2,
      "name": "LINE",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The line number for the information associated with this contact. Multiple pieces of information can be associated with this contact."
    },
    {
      "ordinalPosition": 3,
      "name": "PAT_ENC_DATE_REAL",
      "type": "FLOAT",
      "discontinued": false,
      "description": "A unique contact date in decimal format. The integer portion of the number indicates the date of contact. The digits after the decimal distinguish different contacts on the same date and are unique for each contact on that date. For example, .00 is the first/only contact, .01 is the second contact, etc."
    },
    {
      "ordinalPosition": 4,
      "name": "CONTACT_DATE",
      "type": "DATETIME",
      "discontinued": false,
      "description": "The date of this contact in calendar format."
    },
    {
      "ordinalPosition": 5,
      "name": "SA_KEY",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Identifies a unique event that may update the patient record's service area items. The unique event may be from Admission/Discharge/Transfer information, Cadence, or Referral."
    },
    {
      "ordinalPosition": 6,
      "name": "SA_ACCESSED",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Identifies service area associated with \"Service area update\" event in column SA_KEY. For example, if an admission event is fired for admitting patient in service area \"A\", then this column will contain value \"A\"."
    },
    {
      "ordinalPosition": 7,
      "name": "SA_EXPR_DATE",
      "type": "DATETIME",
      "discontinued": false,
      "description": "Identifies service area expiration date associated with service area in column SA_ACCESSED."
    }
  ]
}
