{
  "name": "PAYOR_COMM_RECIPIENT",
  "description": "The PAYOR_COMM_RECIPIENT table contains information related to recipients in Clinical Case Management's Payor Communication navigator section. This table contains all recipients that have been added to the Payor Communication navigator section for the related encounter, along with the IDs of any related user entered comments (HNO IDs). Note that data related to sending communications is stored in the PAYOR_COMM_HX table, not this table.",
  "primaryKey": [
    {
      "columnName": "PAT_ENC_CSN_ID",
      "ordinalPosition": 1
    },
    {
      "columnName": "LINE",
      "ordinalPosition": 2
    }
  ],
  "columns": [
    {
      "ordinalPosition": 1,
      "name": "PAT_ENC_CSN_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "The unique contact serial number for this contact. This number is unique across all patient encounters in your system. If you use IntraConnect, this is the Unique Contact Identifier (UCI)."
    },
    {
      "ordinalPosition": 2,
      "name": "LINE",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The line number for the information associated with this contact. Multiple pieces of information can be associated with this contact."
    },
    {
      "ordinalPosition": 3,
      "name": "PAT_ENC_DATE_REAL",
      "type": "FLOAT",
      "discontinued": false,
      "description": "A unique contact date in decimal format. The integer portion of the number indicates the date of contact. The digits after the decimal distinguish different contacts on the same date and are unique for each contact on that date. For example, .00 is the first/only contact, .01 is the second contact, etc."
    },
    {
      "ordinalPosition": 4,
      "name": "CONTACT_DATE",
      "type": "DATETIME",
      "discontinued": false,
      "description": "The date of this contact in calendar format."
    },
    {
      "ordinalPosition": 5,
      "name": "CM_CT_OWNER_ID",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The Community ID (CID) of the instance that owns this contact. This is only populated if you use IntraConnect."
    },
    {
      "ordinalPosition": 6,
      "name": "AGENCY_ID",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The ID of a recipient that has been added to the Payor Communication navigator section. There can be several recipients added to the Payor Communication navigator section for each patient.  Each recipient represents a contact (fax/phone/name) for a payor."
    },
    {
      "ordinalPosition": 7,
      "name": "AGENCY_ID_AGENCY_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The name of the agency."
    },
    {
      "ordinalPosition": 8,
      "name": "NOTE_ID",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The ID of a user entered note (comment) (HNO) in the Payor Communication navigator section. Each comment is related to a specific recipient in the context of a specific patient and encounter. The comment in this column is related to the recipient in the AGENCY_ID column of this table. There can be several recipients added to the Payor Comm navigator section for each patient.  Each recipient represents a contact (fax/phone/name) for a payor."
    }
  ]
}
