{
  "name": "PNEG_MED_HX",
  "description": "The PNEG_MED_HX table contains data from pertinent negatives medical history contacts entered in clinical system patient encounters. Since one patient encounter may contain multiple medical history contacts, each contact is uniquely identified by a patient encounter serial number and a line number.",
  "primaryKey": [
    {
      "columnName": "PAT_ENC_CSN_ID",
      "ordinalPosition": 1
    },
    {
      "columnName": "LINE",
      "ordinalPosition": 2
    }
  ],
  "columns": [
    {
      "ordinalPosition": 1,
      "name": "PAT_ENC_CSN_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "A unique serial number for this encounter. This number is unique across all patients and encounters in the system."
    },
    {
      "ordinalPosition": 2,
      "name": "LINE",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The line number for the information associated with this contact. Multiple pieces of information can be associated with this contact."
    },
    {
      "ordinalPosition": 3,
      "name": "PNEG_MED_HX_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "The unique ID of the diagnosis record associated with a patient's pertinent negatives medical history. Note: This is NOT the ICD9 diagnosis code. It is an internal identifier that is typically not visible to a user."
    },
    {
      "ordinalPosition": 4,
      "name": "PNEG_MED_HX_DT",
      "type": "DATETIME",
      "discontinued": false,
      "description": "The entry date for a patient's pertinent negative medical history for a diagnoses."
    },
    {
      "ordinalPosition": 5,
      "name": "PNEG_MED_HX_CMT",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Free text comments entered for the diagnoses in a patient's pertinent negative medical history."
    },
    {
      "ordinalPosition": 6,
      "name": "PNEG_MED_HX_ANNO",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The annotation for the diagnoses in a patient's pertinent negative medical history."
    },
    {
      "ordinalPosition": 7,
      "name": "HX_LNK_ENC_CSN",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "The Contact Serial Number of the encounter in which the history was created/edited. If the history was created/edited outside of the context of an encounter, then this column will be blank."
    },
    {
      "ordinalPosition": 8,
      "name": "PNEG_MED_HX_SRC_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The Pertinent Negative Medical History Source for the Pertinent Negative Medical History contacts. This column defines whether history information was entered by the patient versus the provider or a legal guardian. This can be used to differentiate which information was entered directly by the patient via MyChart or kiosks versus was entered by the provider.",
      "entries": [
        "Provider",
        "Patient",
        "Parent",
        "Legal Guardian",
        "Proxy User"
      ]
    }
  ]
}
