{
  "name": "RAD_THERAPY_ASSOC_COURSES",
  "description": "Lists external radiation courses linked to an episode.\n\n\nEach row is a reference to a course of radiation treatment that was documented in an external system such as MOSAIQ or ARIA.\n\n\nIf the course was automatically associated with a radiation-therapy episode when the course was interfaced to Epic, the likelihood of the match (\"match score\") is indicated as well.",
  "primaryKey": [
    {
      "columnName": "SUMMARY_BLOCK_ID",
      "ordinalPosition": 1
    },
    {
      "columnName": "LINE",
      "ordinalPosition": 2
    }
  ],
  "columns": [
    {
      "ordinalPosition": 1,
      "name": "SUMMARY_BLOCK_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "The unique ID of the episode of care record."
    },
    {
      "ordinalPosition": 2,
      "name": "LINE",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The line number for the information associated with this record. Multiple pieces of information can be associated with this record."
    },
    {
      "ordinalPosition": 3,
      "name": "RAD_THERAPY_COURSE_SRC_SYS_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "This item is for episodes associated with courses of radiation documented in third-party software systems (radiation-therapy episodes). The source system is specified in this item, and the ID of the course is specified in the counterpart Radiation Therapy Course ID (I HSB 38805).",
      "entries": [
        "MOSAIQ",
        "ARIA"
      ]
    },
    {
      "ordinalPosition": 4,
      "name": "RAD_THERAPY_COURSE_IDENT",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "This item is for episodes associated with courses of radiation documented in third-party software systems (radiation-therapy episodes). The ID of the course is specified in this item, and the source system is specified in the counterpart Radiation Therapy Course Source System (I HSB 38800)."
    },
    {
      "ordinalPosition": 5,
      "name": "RAD_THERAPY_COURSE_MATCH_SCORE",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This item is for episodes associated with courses of radiation documented in third-party software systems (radiation-therapy episodes). This item records the match score for a course that is automatically linked to the episode by the system. (The course in question is identified by related items Radiation Therapy Course Source System (I HSB 38800) and Radiation Therapy Course ID (I HSB 38805) combined.)"
    }
  ]
}
