{
  "name": "REGADDL_PAT",
  "description": "The additional registration items are used to store organization specific patient data which is captured during Prelude or ADT workflows. The REGADDL_PAT table contains all of the patient level items where a user may enter only a single value.",
  "primaryKey": [
    {
      "columnName": "PAT_ID",
      "ordinalPosition": 1
    }
  ],
  "columns": [
    {
      "ordinalPosition": 1,
      "name": "PAT_ID",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The unique ID of the patient record for this row. This column is frequently used to link to the PATIENT table.",
      "linksTo": "PATIENT"
    },
    {
      "ordinalPosition": 2,
      "name": "REGADDL_PAT_1_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "First of eight additional registration patient level category columns. The usage of this data element is defined by your organization."
    },
    {
      "ordinalPosition": 3,
      "name": "REGADDL_PAT_2_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Second of eight additional registration patient level category columns. The usage of this data element is defined by your organization."
    },
    {
      "ordinalPosition": 4,
      "name": "REGADDL_PAT_3_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Third of eight additional registration patient level category columns. The usage of this data element is defined by your organization."
    },
    {
      "ordinalPosition": 5,
      "name": "REGADDL_PAT_4_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Fourth of eight additional registration patient level category columns. The usage of this data element is defined by your organization."
    },
    {
      "ordinalPosition": 6,
      "name": "REGADDL_PAT_5_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Fifth of eight additional registration patient level category columns. The usage of this data element is defined by your organization."
    },
    {
      "ordinalPosition": 7,
      "name": "REGADDL_PAT_6_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Sixth of eight additional registration patient level category columns. The usage of this data element is defined by your organization."
    },
    {
      "ordinalPosition": 8,
      "name": "REGADDL_PAT_7_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Seventh of eight additional registration patient level category columns. The usage of this data element is defined by your organization."
    },
    {
      "ordinalPosition": 9,
      "name": "REGADDL_PAT_8_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Eighth of eight additional registration patient level category columns. The usage of this data element is defined by your organization."
    },
    {
      "ordinalPosition": 10,
      "name": "REGADDL_PAT_1_DT",
      "type": "DATETIME",
      "discontinued": false,
      "description": "First of three additional registration patient level date columns. The usage of this data element is defined by your organization."
    },
    {
      "ordinalPosition": 11,
      "name": "REGADDL_PAT_2_DT",
      "type": "DATETIME",
      "discontinued": false,
      "description": "Second of three additional registration patient level date columns. The usage of this data element is defined by your organization."
    },
    {
      "ordinalPosition": 12,
      "name": "REGADDL_PAT_3_DT",
      "type": "DATETIME",
      "discontinued": false,
      "description": "Third of three additional registration patient level date columns. The usage of this data element is defined by your organization."
    },
    {
      "ordinalPosition": 13,
      "name": "REGADDL_PAT_1_TM",
      "type": "DATETIME (Local) ",
      "discontinued": false,
      "description": "First of three additional registration patient level time columns. The usage of this data element is defined by your organization."
    },
    {
      "ordinalPosition": 14,
      "name": "REGADDL_PAT_2_TM",
      "type": "DATETIME (Local) ",
      "discontinued": false,
      "description": "Second of three additional registration patient level time columns. The usage of this data element is defined by your organization."
    },
    {
      "ordinalPosition": 15,
      "name": "REGADDL_PAT_3_TM",
      "type": "DATETIME (Local) ",
      "discontinued": false,
      "description": "Third of three additional registration patient level time columns. The usage of this data element is defined by your organization."
    },
    {
      "ordinalPosition": 16,
      "name": "REGADDL_PAT_1_NUM",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "First of three additional registration patient level numeric columns. The usage of this data element is defined by your organization."
    },
    {
      "ordinalPosition": 17,
      "name": "REGADDL_PAT_2_NUM",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "Second of three additional registration patient level numeric columns. The usage of this data element is defined by your organization."
    },
    {
      "ordinalPosition": 18,
      "name": "REGADDL_PAT_3_NUM",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "Third of three additional registration patient level numeric columns. The usage of this data element is defined by your organization."
    },
    {
      "ordinalPosition": 19,
      "name": "REGADDL_PAT_1_STR",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "First of five additional registration patient level string columns. The usage of this data element is defined by your organization."
    },
    {
      "ordinalPosition": 20,
      "name": "REGADDL_PAT_2_STR",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Second of five additional registration patient level string columns. The usage of this data element is defined by your organization."
    },
    {
      "ordinalPosition": 21,
      "name": "REGADDL_PAT_3_STR",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Third of five additional registration patient level string columns. The usage of this data element is defined by your organization."
    },
    {
      "ordinalPosition": 22,
      "name": "REGADDL_PAT_4_STR",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Fourth of five additional registration patient level string columns. The usage of this data element is defined by your organization."
    },
    {
      "ordinalPosition": 23,
      "name": "REGADDL_PAT_5_STR",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Fifth of five additional registration patient level string columns. The usage of this data element is defined by your organization."
    }
  ]
}
