{
  "name": "RX_MED_TRANSITION",
  "description": "Table for information about medication transitions functionality available in outpatient pharmacy.  One record in this table corresponds to one pharmacy system-level initiative to transition patients to a new medication, or to have their medication changed in some clinically significant way.  One such record is stored in the LFT masterfile, and contains data such as a description of the system-level initiative, as well as instructions intended for ambulatory pharmacy users that might encounter medications marked with this medication transition data.",
  "primaryKey": [
    {
      "columnName": "FOLLOW_UP_1_ID",
      "ordinalPosition": 1
    }
  ],
  "columns": [
    {
      "ordinalPosition": 1,
      "name": "FOLLOW_UP_1_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "The unique identifier (.1 item) for the tracking record."
    },
    {
      "ordinalPosition": 2,
      "name": "CM_PHY_OWNER_ID",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The Community ID (CID) of the instance that owns this record or line. This is only populated if you use IntraConnect."
    },
    {
      "ordinalPosition": 3,
      "name": "DESCRIPTION",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "This item stores a description of the medication transition represented by the LFT record."
    },
    {
      "ordinalPosition": 4,
      "name": "INSTRUCTIONS",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "This item stores the instructions displayed to ambulatory pharmacy system users when they are informed that a prescription identified by its linkage to this LFT record is to be transitioned to a different medication."
    },
    {
      "ordinalPosition": 5,
      "name": "CREATING_USER_ID",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "This item stores the user that created the medication transition LFT record."
    },
    {
      "ordinalPosition": 6,
      "name": "CREATING_USER_ID_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The name of the user record. This name may be hidden."
    },
    {
      "ordinalPosition": 7,
      "name": "FLG_FILLS_IN_PROGRESS_YN",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "This item determines whether associating prescriptions with a medication transition should flag fills in progress.",
      "entries": [
        "No",
        "Yes"
      ]
    }
  ]
}
