{
  "name": "RX_RXW_ORDER_INFO",
  "description": "Each work request can have any number of fill requests attached signifying the dispenses that should be grouped together. This table includes the patient, order and order dat for each fill request attached to the work request.\n\n\n\n\n\nThe primary key for this table is RECORD_ID and LINE. The RECORD_ID column can be linked to the RX_RXW table in order to include general work request information in the report.",
  "primaryKey": [
    {
      "columnName": "RECORD_ID",
      "ordinalPosition": 1
    },
    {
      "columnName": "LINE",
      "ordinalPosition": 2
    }
  ],
  "columns": [
    {
      "ordinalPosition": 1,
      "name": "RECORD_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "Record ID of the work request."
    },
    {
      "ordinalPosition": 2,
      "name": "LINE",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The line number for the information associated with this record. Multiple pieces of information can be associated with this record."
    },
    {
      "ordinalPosition": 3,
      "name": "FILL_REQ_ORDER_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "Each work request can be attached to a fill request contact on any number of orders. This column links this work request with a given order. It can be linked to any order related table to include order related information in the report."
    },
    {
      "ordinalPosition": 4,
      "name": "FILL_REQ_ORDER_DAT",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "A fill request is a contact on the order record documenting a dispense of that order to the patient. This field specifies which fill request (or contact) on the order is associated with this work request. Each fill request on an order will be linked to a separate work request documenting that set of dispenses to the patient."
    },
    {
      "ordinalPosition": 5,
      "name": "ADV_PREP_ORD_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "This is the order ID of a cross-encounter signed and held inpatient e-prescription that has been sent to the pharmacy for advance prep."
    }
  ]
}
