{
  "name": "SPEC_ARCHIVE_ORDER",
  "description": "Contains information about orders that were archived as part of deceased patient archiving.",
  "primaryKey": [
    {
      "columnName": "SPECIMEN_ID",
      "ordinalPosition": 1
    },
    {
      "columnName": "LINE",
      "ordinalPosition": 2
    }
  ],
  "columns": [
    {
      "ordinalPosition": 1,
      "name": "SPECIMEN_ID",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The unique identifier for the specimen record."
    },
    {
      "ordinalPosition": 2,
      "name": "LINE",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The line number for the information associated with this record. Multiple pieces of information can be associated with this record."
    },
    {
      "ordinalPosition": 3,
      "name": "ARCH_ORDER_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "The identifier of an order that has been archived as part of deceased patient archiving. Once the order is archived, all of the data from the order record is deleted and will not be available. This related group of items in the specimen record will be populated at the time of archiving by copying the most important pieces of information from the order record."
    },
    {
      "ordinalPosition": 4,
      "name": "ARCH_ORD_PROC_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Name of an order that has been archived as part of deceased patient archiving. Once the order is archived, all of the data from the order record is deleted and will not be available. This related group of items in the specimen record will be populated at the time of archiving by copying the most important pieces of information from the order record."
    },
    {
      "ordinalPosition": 5,
      "name": "ARCH_ORD_PANEL_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Name of an order panel that has been archived as part of deceased patient archiving. Once the order is archived, all of the data from the order record is deleted and will not be available. This related group of items in the specimen record will be populated at the time of archiving by copying the most important pieces of information from the order record."
    },
    {
      "ordinalPosition": 6,
      "name": "ARCH_ORD_USER_ID",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The unique identifier of the ordering user for an order that has been archived as part of deceased patient archiving. Once the order is archived, all of the data from the order record is deleted and will not be available. This related group of items in the specimen record will be populated at the time of archiving by copying the most important pieces of information from the order record."
    },
    {
      "ordinalPosition": 7,
      "name": "ARCH_ORD_USER_ID_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The name of the user record. This name may be hidden."
    },
    {
      "ordinalPosition": 8,
      "name": "ARCH_ORD_DEP_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "The unique identifier of the ordering department for an order that has been archived as part of deceased patient archiving. Once the order is archived, all of the data from the order record is deleted and will not be available. This related group of items in the specimen record will be populated at the time of archiving by copying the most important pieces of information from the order record."
    },
    {
      "ordinalPosition": 9,
      "name": "ARCH_ORD_DTTM",
      "type": "DATETIME (Local) ",
      "discontinued": false,
      "description": "Prioritized instant for an order that has been archived as part of deceased patient archiving. Once the order is archived, all of the data from the order record is deleted and will not be available. This related group of items in the specimen record will be populated at the time of archiving by copying the most important pieces of information from the order record."
    },
    {
      "ordinalPosition": 10,
      "name": "ARCH_CSN_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "Encounter contact serial number for an order that has been archived as part of deceased patient archiving. Once the order is archived, all of the data from the order record is deleted and will not be available. This related group of items in the specimen record will be populated at the time of archiving by copying the most important pieces of information from the order record."
    },
    {
      "ordinalPosition": 11,
      "name": "ARCH_AUTH_PROV_ID",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The unique identifier of the authorizing provider for an order that has been archived as part of deceased patient archiving. Once the order is archived, all of the data from the order record is deleted and will not be available. This related group of items in the specimen record is populated at the time of archiving by copying the most important pieces of information from the order record."
    }
  ]
}
