{
  "name": "SSC_GEN_ENC_INFO",
  "description": "The SSC_GEN_ENC_INFO table contains one row for each patient-level SmartSet Information contact in the system. These rows contain fields that may be updated for each contact such as contact date, contact owner, and contact type. This table also stores details on care plan goals and interventions and task templates associated with SmartSet Information records.",
  "primaryKey": [
    {
      "columnName": "CONTACT_SERIAL_NUM",
      "ordinalPosition": 1
    }
  ],
  "columns": [
    {
      "ordinalPosition": 1,
      "name": "RECORD_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "The unique ID of the patient-level SmartSet Information record."
    },
    {
      "ordinalPosition": 2,
      "name": "CONTACT_SERIAL_NUM",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "The unique contact serial number for this contact. This number is unique across all patient-level SmartSet Information encounters in your system. If you use IntraConnect this is the Unique Contact Identifier (UCI)."
    },
    {
      "ordinalPosition": 3,
      "name": "GOAL_ID",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The unique ID of the care plan goal that is linked to this SmartSet Information record."
    },
    {
      "ordinalPosition": 4,
      "name": "INTERVENTION_ID",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The unique ID of the care plan intervention that is linked to this SmartSet Information record."
    },
    {
      "ordinalPosition": 5,
      "name": "TASK_TEMPLATE_ID",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The unique ID of the task template that is linked to this SmartSet Information record."
    },
    {
      "ordinalPosition": 6,
      "name": "TASK_TEMPLATE_ID_RECORD_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "This column displays the name of the task template record."
    },
    {
      "ordinalPosition": 7,
      "name": "TASK_TEMPLATE_DAT",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The unique, internal contact date in decimal format of the task template that is linked to this SmartSet Information record. The integer portion of the number indicates the date of the contact. The digits after the decimal distinguish different contacts on the same date and are unique for each contact on that date. For example, .00 is the first/only contact, .01 is the second contact, etc."
    }
  ]
}
