{
  "name": "TC_REQUEST_PROV_DOC",
  "description": "This contains the decisions that were made by potential accepting providers about whether to accept or decline a Transfer Center request.",
  "primaryKey": [
    {
      "columnName": "COMM_ID",
      "ordinalPosition": 1
    },
    {
      "columnName": "LINE",
      "ordinalPosition": 2
    }
  ],
  "columns": [
    {
      "ordinalPosition": 1,
      "name": "COMM_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "The unique identifier for the communication record."
    },
    {
      "ordinalPosition": 2,
      "name": "LINE",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The line number for the information associated with this record. Multiple pieces of information can be associated with this record."
    },
    {
      "ordinalPosition": 3,
      "name": "CONTACT_IDNT",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This stores the line number of a Contact Log entry that made a decision on whether or not to accept a Transfer Center request."
    },
    {
      "ordinalPosition": 4,
      "name": "LOC_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "Represents the ID of a location for which a decision was made about whether or not to accept a Transfer Center request."
    },
    {
      "ordinalPosition": 5,
      "name": "PAT_SERVICE_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The hospital service category ID for which a decision was made about whether or not to accept a Transfer Center request."
    },
    {
      "ordinalPosition": 6,
      "name": "PROV_APPROVED_YN",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Indicates whether a provider approved or declined a Transfer Center request. 'Y' indicates that the provider approved the transfer. 'N' indicates that they did not approve the transfer.",
      "entries": [
        "No",
        "Yes"
      ]
    },
    {
      "ordinalPosition": 7,
      "name": "DECISION_INST_DTTM",
      "type": "DATETIME (UTC) ",
      "discontinued": false,
      "description": "Represents the instant at which a decision was made to accept or decline a Transfer Center request."
    },
    {
      "ordinalPosition": 8,
      "name": "TC_PROV_DECLN_RSN_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The decline reason category ID that specifies why a provider declined a Transfer Center request."
    },
    {
      "ordinalPosition": 9,
      "name": "ADMT_PROV_YN",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Indicates whether this decision was also where the provider was decided to be the admitting provider for the resultant encounter of the Transfer Center request. 'Y' indicates that the provider will be the admitting provider. 'N' indicates that the provider will not be the admitting provider."
    },
    {
      "ordinalPosition": 10,
      "name": "ASSOCIATED_CALL_ID",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The ID of the call record on which a decision was made."
    },
    {
      "ordinalPosition": 11,
      "name": "CURRENT_YN",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Indicates whether this decision is current or has been overridden by a later decision. 'Y' indicates that this decision is still current, 'N' indicates that this decision has been overridden by a later one."
    },
    {
      "ordinalPosition": 12,
      "name": "LOC_IS_REF_YN",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "This indicates whether the decision was made for the referring facility of the Transfer Center request before a referring facility was actually entered. 'Y' indicates that this decision was made for the referring facility. 'N' indicates that this decision was not made for the referring facility."
    }
  ]
}
