{
  "name": "TXP_MELD_PELD_HX",
  "description": "This table contains the liver score history for a transplant episode.",
  "primaryKey": [
    {
      "columnName": "SUMMARY_BLOCK_ID",
      "ordinalPosition": 1
    },
    {
      "columnName": "LINE",
      "ordinalPosition": 2
    }
  ],
  "columns": [
    {
      "ordinalPosition": 1,
      "name": "SUMMARY_BLOCK_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "The unique identifier for the episode record."
    },
    {
      "ordinalPosition": 2,
      "name": "LINE",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The line number for the information associated with this record. Multiple pieces of information can be associated with this record."
    },
    {
      "ordinalPosition": 3,
      "name": "MELD_SCORE",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The patient's Model for End-Stage Liver Disease (MELD) score for this transplant episode."
    },
    {
      "ordinalPosition": 4,
      "name": "PELD_SCORE",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The patient's Pediatric Model for End-Stage Liver Disease (PELD) score for the transplant episode."
    },
    {
      "ordinalPosition": 5,
      "name": "MELD_DATE",
      "type": "DATETIME",
      "discontinued": false,
      "description": "The date the corresponding Model for End-Stage Liver Disease (MELD) value or liver status was last updated for the transplant episode."
    },
    {
      "ordinalPosition": 6,
      "name": "PELD_DATE",
      "type": "DATETIME",
      "discontinued": false,
      "description": "The date the corresponding Pediatric Model for End-Stage Liver Disease (PELD) value or liver status was last updated for the transplant episode."
    },
    {
      "ordinalPosition": 7,
      "name": "MELD_PELD_OTHER_EX",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The free-text exception for the corresponding Model for End-Stage Liver Disease (MELD) score, Pediatric Model for End-Stage Liver Disease (PELD) score, or liver status for the transplant episode."
    },
    {
      "ordinalPosition": 8,
      "name": "LIVER_STATUS_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The liver status that has been entered in the United Network of Organ Sharing (UNOS) instead of a Model for End-Stage Liver Disease (MELD) or Pediatric Model for End-Stage Liver Disease (PELD) score for the transplant episode.",
      "entries": [
        "One A",
        "One B"
      ]
    }
  ]
}
