{
  "name": "VISIT_SET_ROUTE",
  "description": "The VISIT_SET_ROUTE table contains information about the route, or generic provider record, assigned to a specific visit set.",
  "primaryKey": [
    {
      "columnName": "VISIT_SET_ID",
      "ordinalPosition": 1
    },
    {
      "columnName": "CONTACT_DATE_REAL",
      "ordinalPosition": 2
    },
    {
      "columnName": "LINE",
      "ordinalPosition": 3
    }
  ],
  "columns": [
    {
      "ordinalPosition": 1,
      "name": "VISIT_SET_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "The unique identifier (.1 item) for the visit set record."
    },
    {
      "ordinalPosition": 2,
      "name": "CONTACT_DATE_REAL",
      "type": "FLOAT",
      "discontinued": false,
      "description": "A unique contact date in decimal format. The integer portion of the number indicates the date of contact. The digits after the decimal distinguish different contacts on the same date and are unique for each contact on that date. For example, .00 is the first/only contact, .01 is the second contact, etc."
    },
    {
      "ordinalPosition": 3,
      "name": "LINE",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The line number for the information associated with this contact. Multiple pieces of information can be associated with this contact."
    },
    {
      "ordinalPosition": 4,
      "name": "CONTACT_DATE",
      "type": "DATETIME",
      "discontinued": false,
      "description": "The date of this contact."
    },
    {
      "ordinalPosition": 5,
      "name": "ROUTE_DISCIPLINE_KEY",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "A key that identifies a single instance of a single required provider of a certain discipline, in the form <LDS ID>^<COUNT> where LDS ID is a discipline record stored in VISIT_SET_DISCIPLINE__DISCIPLINE_DISC_TYPE_ID and COUNT is a number greater than 0 but less than or equal to the count stored in VISIT_SET_DISCIPLINE__DISCIPLINE_COUNT on the same line as the discipline ID. For example, if we require 2 providers of discipline 1001, and 1 provider of discipline 2002, possible values for this column are limitted to: 1001^1, 1001^2, and 2002^1. Associated with these discipline requirements are the providers with whom to schedule with in order to fulfill them, stored in ROUTE_RESOURCE_PROV_ID."
    },
    {
      "ordinalPosition": 6,
      "name": "ROUTE_RESOURCE_PROV_ID",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The provider resource with which to schedule in order to fulfill the discipline requirement in ROUTE_DISCIPLINE_KEY. Join LINE with GROUP_LINE of VISIT_SET_ROUTES_DAYS_WEEK to access the days of the week on which this provider will be scheduled. It is possible that different providers fulfill a single discipline requirement on different days of the week."
    }
  ]
}
